[
  {
    "id": 1,
    "imageFilePath": "./image/1",
    "name": "Bún Bò Huế",
    "reviewStar": 4.8,
    "reviewCount": 2,
    "viewCount": 12,
    "authorId": 0,
    "publishDate": "22/10/2024",
    "cookTime": "60 phút",
    "description": "Bún Bò Huế là một món ăn đặc sản của miền Trung Việt Nam, nổi bật với hương vị cay nồng và nước dùng thơm ngon từ xương bò. Sợi bún dai mềm, kết hợp với thịt bò thái mỏng, chả và tiết lợn tạo nên sự đa dạng trong hương vị. Món ăn được phục vụ kèm rau sống, hành và một chút mắm ruốc đặc trưng, tạo nên tổng thể hài hòa và đậm đà.",
    "ingredients": [
      "bún",
      "thịt bò",
      "xương bò",
      "chả lụa",
      "rau sống",
      "mắm ruốc"
    ],
    "procedure": [
      "Rửa sạch xương bò và luộc sơ qua để khử mùi.",
      "Hầm xương bò trong nồi nước khoảng 1 giờ để lấy nước dùng.",
      "Thêm mắm ruốc và các gia vị vào nước dùng, đun sôi.",
      "Luộc thịt bò, thái lát mỏng và để riêng.",
      "Trụng bún qua nước sôi, cho vào bát, thêm thịt bò, chả lụa và nước dùng."
    ],
    "comments": [
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "imagePath": "./image/comment_images/1_1.jfif",
        "commentText": "Bún Bò Huế rất ngon và đậm đà, hương vị đúng chuẩn miền Trung!"
      },
      {
        "userName": "Harry",
        "reviewStar": 4,
        "imagePath": "./image/comment_images/18_7.jpg",
        "commentText": "Cay và thơm ngon, món này rất hợp khẩu vị của tôi."
      }
    ]
  },
  {
    "id": 2,
    "imageFilePath": "./image/2",
    "name": "Cơm Tấm Sườn Nướng",
    "reviewStar": 4.9,
    "reviewCount": 2,
    "viewCount": 12,
    "authorId": 0,
    "publishDate": "22/10/2024",
    "cookTime": "50 phút",
    "description": "Cơm Tấm Sườn Nướng là một món ăn đặc trưng của Sài Gòn, với sườn nướng thơm lừng, mềm mịn, kết hợp với cơm tấm dẻo. Món ăn thường được ăn kèm với trứng ốp la, bì heo, và nước mắm pha chua ngọt. Sự hòa quyện giữa vị ngọt của sườn, chua cay của nước mắm, và sự mát lạnh của rau sống tạo nên một trải nghiệm ẩm thực không thể quên.",
    "ingredients": [
      "cơm tấm",
      "sườn heo",
      "trứng gà",
      "nước mắm",
      "rau sống"
    ],
    "procedure": [
      "Ướp sườn heo với nước mắm, tỏi và đường trong 30 phút.",
      "Nướng sườn trên than hoa cho đến khi chín vàng đều.",
      "Luộc trứng và trụng cơm tấm qua nước sôi.",
      "Xếp cơm ra đĩa, thêm sườn, trứng và rau sống.",
      "Rưới nước mắm pha chua ngọt lên và thưởng thức."
    ],
    "comments": [
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Sườn nướng rất mềm và thấm vị, cơm tấm ngon tuyệt!"
      },
      {
        "userName": "Fred",
        "reviewStar": 4,
        "commentText": "Món ăn đơn giản mà cực kỳ hấp dẫn, tôi rất thích!"
      }
    ]
  },
  {
    "id": 3,
    "imageFilePath": "./image/3",
    "name": "Bánh Mì Thịt Nướng",
    "reviewStar": 4.7,
    "reviewCount": 2,
    "viewCount": 12,
    "authorId": 0,
    "publishDate": "22/10/2024",
    "cookTime": "20 phút",
    "description": "Bánh Mì Thịt Nướng là món ăn đường phố nổi tiếng của Việt Nam, được yêu thích bởi hương vị đậm đà và lớp bánh mì giòn tan. Thịt nướng thơm lừng kết hợp với dưa leo, đồ chua và nước sốt đặc biệt tạo nên sự cân bằng hoàn hảo. Món ăn này không chỉ nhanh chóng, tiện lợi mà còn rất bổ dưỡng, phù hợp với bữa sáng hoặc bữa ăn nhẹ trong ngày.",
    "ingredients": [
      "bánh mì",
      "thịt nướng",
      "dưa leo",
      "đồ chua",
      "nước sốt"
    ],
    "procedure": [
      "Ướp thịt nướng với nước mắm, tỏi, và gia vị khoảng 15 phút.",
      "Nướng thịt trên bếp than hoặc lò nướng cho đến khi chín.",
      "Cắt bánh mì và cho thịt nướng, dưa leo, đồ chua vào giữa.",
      "Rưới nước sốt đặc biệt lên trên và thưởng thức."
    ],
    "comments": [
      {
        "userName": "Emma",
        "reviewStar": 5,
        "commentText": "Bánh mì giòn rụm và thịt nướng thơm ngon, đúng là món ăn yêu thích của tôi!"
      },
      {
        "userName": "Bob",
        "reviewStar": 4,
        "commentText": "Nhanh gọn và rất ngon, tôi sẽ làm lại món này!"
      }
    ]
  },
  {
    "id": 4,
    "imageFilePath": "./image/4",
    "name": "Phở Bò",
    "reviewStar": 4.9,
    "reviewCount": 2,
    "viewCount": 12,
    "authorId": 0,
    "publishDate": "22/10/2024",
    "cookTime": "70 phút",
    "description": "Phở Bò là món ăn quốc hồn quốc túy của Việt Nam, với nước dùng thanh ngọt được ninh từ xương bò cùng các loại thảo mộc như quế, hồi, thảo quả. Thịt bò tái mềm mịn, sợi phở dai và rau sống ăn kèm tạo nên sự hài hòa. Đây là món ăn lý tưởng cho bữa sáng hay bất kỳ thời điểm nào trong ngày, mang lại cảm giác ấm áp và đầy hương vị.",
    "ingredients": [
      "phở",
      "thịt bò",
      "xương bò",
      "hành tây",
      "rau sống"
    ],
    "procedure": [
      "Ninh xương bò với các loại thảo mộc trong 1 giờ để lấy nước dùng.",
      "Thái thịt bò thật mỏng và nhúng tái trong nước dùng nóng.",
      "Trụng phở qua nước sôi và cho vào bát.",
      "Rưới nước dùng lên phở, thêm thịt bò và rau sống.",
      "Thưởng thức phở với nước mắm hoặc tương ớt tùy thích."
    ],
    "comments": [
      {
        "userName": "Alice",
        "reviewStar": 5,
        "commentText": "Phở ngon chuẩn vị, nước dùng thanh ngọt, rất đáng thử!"
      },
      {
        "userName": "Claire",
        "reviewStar": 4,
        "commentText": "Món phở tuyệt vời, nhưng nấu nước dùng khá mất thời gian."
      }
    ]
  },
  {
    "id": 5,
    "imageFilePath": "./image/5",
    "name": "Gỏi Cuốn",
    "reviewStar": 4.8,
    "reviewCount": 2,
    "viewCount": 12,
    "authorId": 0,
    "publishDate": "22/10/2024",
    "cookTime": "25 phút",
    "description": "Gỏi Cuốn là món ăn nhẹ nhàng và thanh mát, với nguyên liệu chính là tôm, thịt heo và rau sống cuộn trong bánh tráng. Món ăn này không chỉ dễ làm mà còn rất tốt cho sức khỏe nhờ sử dụng nhiều rau xanh. Khi ăn, gỏi cuốn thường được chấm cùng nước mắm hoặc tương đậu phộng, tạo nên hương vị độc đáo và cân bằng giữa các thành phần.",
    "ingredients": [
      "bánh tráng",
      "tôm",
      "thịt heo",
      "rau sống",
      "bún"
    ],
    "procedure": [
      "Luộc tôm và thịt heo, thái lát mỏng.",
      "Ngâm bún trong nước sôi và trụng qua nước lạnh.",
      "Cuốn tôm, thịt heo, rau sống và bún vào bánh tráng.",
      "Pha nước chấm từ nước mắm hoặc tương đậu phộng.",
      "Chấm gỏi cuốn vào nước chấm và thưởng thức."
    ],
    "comments": [
      {
        "userName": "Dave",
        "reviewStar": 5,
        "commentText": "Gỏi cuốn tươi ngon và rất dễ làm, cả nhà ai cũng thích."
      },
      {
        "userName": "Fred",
        "reviewStar": 4,
        "commentText": "Ngon nhưng cần nhiều nguyên liệu, chấm nước mắm rất hợp!"
      }
    ]
  },
  {
    "id": 6,
    "imageFilePath": "./image/6",
    "name": "Bánh Xèo",
    "reviewStar": 4.7,
    "reviewCount": 2,
    "viewCount": 12,
    "authorId": 0,
    "publishDate": "22/10/2024",
    "cookTime": "40 phút",
    "description": "Bánh Xèo là món bánh truyền thống của miền Nam Việt Nam, nổi bật với lớp vỏ giòn rụm làm từ bột gạo và nước cốt dừa. Nhân bánh thường bao gồm tôm, thịt và giá đỗ, tạo nên sự kết hợp hoàn hảo giữa giòn, béo và ngọt. Khi ăn, bánh xèo được cuốn với rau sống và chấm cùng nước mắm chua ngọt, mang lại cảm giác ngon miệng và khó cưỡng.",
    "ingredients": [
      "bột gạo",
      "tôm",
      "thịt heo",
      "giá đỗ",
      "rau sống"
    ],
    "procedure": [
      "Pha bột gạo với nước cốt dừa và chút muối, khuấy đều.",
      "Đổ bột vào chảo nóng, thêm tôm, thịt và giá đỗ vào giữa.",
      "Chiên bánh đến khi vàng giòn, gấp đôi lại.",
      "Phục vụ bánh xèo với rau sống và nước mắm chua ngọt.",
      "Cuốn bánh xèo với rau sống và chấm nước mắm khi ăn."
    ],
    "comments": [
      {
        "userName": "Bob",
        "reviewStar": 5,
        "commentText": "Bánh xèo giòn rụm và nhân đầy đặn, rất ngon và hấp dẫn!"
      },
      {
        "userName": "Gina",
        "reviewStar": 4,
        "commentText": "Bánh xèo ngon nhưng chiên hơi nhiều dầu, ăn với rau rất hợp."
      }
    ]
  },
  {
    "id": 7,
    "imageFilePath": "./image/7",
    "name": "Spaghetti Carbonara",
    "reviewStar": 4.6,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 0,
    "publishDate": "22/10/2024",
    "cookTime": "30 phút",
    "description": "Spaghetti Carbonara là món ăn cổ điển của Ý, với sốt kem béo ngậy từ trứng, phô mai Parmesan và pancetta. Vị giòn của pancetta kết hợp với vị ngậy của trứng và phô mai tạo nên sự hài hòa đặc trưng. Đây là món ăn dễ làm và lý tưởng cho các bữa tối hoặc khi có khách.",
    "ingredients": [
      "spaghetti",
      "pancetta",
      "trứng",
      "phô mai Parmesan",
      "tiêu đen"
    ],
    "procedure": [
      "Luộc spaghetti trong nước muối đến khi vừa chín tới (al dente).",
      "Rán pancetta cho đến khi giòn, sau đó để sang một bên.",
      "Đánh trứng và phô mai Parmesan vào nhau.",
      "Đổ spaghetti vừa luộc vào hỗn hợp trứng và phô mai.",
      "Thêm pancetta và rắc tiêu đen, sau đó dọn lên đĩa."
    ],
    "comments": [
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Món ăn dễ làm và rất ngon! Pancetta giòn rất hợp với sốt kem."
      },
      {
        "userName": "Fred",
        "reviewStar": 4,
        "commentText": "Ngon nhưng hơi nặng với mình. Tuy nhiên, vẫn là món ăn an ủi!"
      },
      {
        "userName": "Emma",
        "reviewStar": 5,
        "commentText": "Món này siêu ngon và béo ngậy, chắc chắn sẽ nấu lại."
      }
    ]
  },
  {
    "id": 8,
    "imageFilePath": "./image/8",
    "name": "Sushi Cá Hồi",
    "reviewStar": 4.8,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 0,
    "publishDate": "22/10/2024",
    "cookTime": "20 phút",
    "description": "Sushi cá hồi là món ăn nổi tiếng của Nhật Bản, với nguyên liệu chính là cá hồi tươi sống được cuộn cùng cơm giấm. Món này không chỉ ngon mà còn rất bổ dưỡng, với hương vị thanh mát của cá hồi hòa quyện với cơm dẻo và vị cay của wasabi. Sushi là lựa chọn tuyệt vời cho những bữa ăn nhẹ và thanh đạm.",
    "ingredients": [
      "cá hồi tươi",
      "cơm giấm",
      "rong biển",
      "wasabi",
      "xì dầu"
    ],
    "procedure": [
      "Chuẩn bị cơm giấm bằng cách trộn giấm, đường và muối vào cơm đã nấu.",
      "Cắt cá hồi thành lát mỏng vừa ăn.",
      "Cuộn cá hồi cùng với cơm và rong biển thành từng miếng nhỏ.",
      "Chấm sushi vào xì dầu pha wasabi và thưởng thức."
    ],
    "comments": [
      {
        "userName": "Harry",
        "reviewStar": 5,
        "commentText": "Sushi rất tươi và ngon, cá hồi mềm và ngọt. Rất đáng thử!"
      },
      {
        "userName": "Gina",
        "reviewStar": 4,
        "commentText": "Món sushi ngon, nhưng cần cẩn thận chọn cá hồi tươi."
      },
      {
        "userName": "Bob",
        "reviewStar": 5,
        "commentText": "Sushi chuẩn vị Nhật, dễ làm và rất ngon."
      },
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Sushi ngon và dễ thực hiện tại nhà, rất hài lòng!"
      }
    ]
  },
  {
    "id": 9,
    "imageFilePath": "./image/9",
    "name": "Tacos Mexico",
    "reviewStar": 4.7,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 0,
    "publishDate": "22/10/2024",
    "cookTime": "35 phút",
    "description": "Tacos là món ăn đường phố nổi tiếng của Mexico, với vỏ bánh giòn hoặc mềm được nhồi nhân từ thịt bò, rau sống và các loại nước sốt. Món này hấp dẫn bởi hương vị đậm đà của thịt kết hợp với sự tươi mát của rau, rất dễ ăn và có thể tùy biến theo sở thích.",
    "ingredients": [
      "vỏ bánh tacos",
      "thịt bò",
      "xà lách",
      "cà chua",
      "nước sốt salsa"
    ],
    "procedure": [
      "Xào thịt bò với gia vị đến khi chín vàng.",
      "Cắt nhỏ xà lách và cà chua.",
      "Cho thịt bò, xà lách và cà chua vào vỏ bánh tacos.",
      "Rưới nước sốt salsa lên trên và cuộn lại.",
      "Thưởng thức với nước sốt thêm nếu muốn."
    ],
    "comments": [
      {
        "userName": "Dave",
        "reviewStar": 4,
        "commentText": "Tacos rất ngon nhưng hơi khô, cần thêm nhiều sốt salsa hơn."
      },
      {
        "userName": "Alice",
        "reviewStar": 5,
        "commentText": "Món ăn Mexico đúng điệu, dễ làm và rất vừa miệng!"
      },
      {
        "userName": "Fred",
        "reviewStar": 5,
        "commentText": "Tacos rất tuyệt, ăn rất vừa miệng và nhanh gọn!"
      }
    ]
  },
  {
    "id": 10,
    "imageFilePath": "./image/10",
    "name": "Pizza Margherita",
    "reviewStar": 4.9,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 0,
    "publishDate": "22/10/2024",
    "cookTime": "15 phút",
    "description": "Pizza Margherita là món ăn biểu tượng của nước Ý, với lớp đế bánh giòn nhẹ, phủ lên sốt cà chua tươi, phô mai mozzarella, và lá húng quế. Món pizza này không chỉ nổi bật bởi sự đơn giản mà còn bởi sự cân bằng hoàn hảo giữa các nguyên liệu, tạo nên hương vị tươi mới và thanh thoát.",
    "ingredients": [
      "đế pizza",
      "sốt cà chua",
      "phô mai mozzarella",
      "lá húng quế",
      "dầu ô liu"
    ],
    "procedure": [
      "Phết sốt cà chua đều lên đế pizza đã nướng sẵn.",
      "Rải phô mai mozzarella đều lên bề mặt sốt.",
      "Nướng pizza trong lò ở nhiệt độ cao cho đến khi phô mai tan chảy và có màu vàng nhẹ.",
      "Trang trí với lá húng quế tươi và rưới một chút dầu ô liu trước khi thưởng thức."
    ],
    "comments": [
      {
        "userName": "Harry",
        "reviewStar": 5,
        "commentText": "Pizza rất ngon, đơn giản nhưng vị thật tươi mới!"
      },
      {
        "userName": "Gina",
        "reviewStar": 4,
        "commentText": "Món pizza dễ làm và ăn rất vừa miệng, nhưng phô mai hơi ít."
      },
      {
        "userName": "Bob",
        "reviewStar": 5,
        "commentText": "Pizza Margherita chuẩn vị Ý, lớp đế giòn và phô mai béo ngậy!"
      }
    ]
  },
  {
    "id": 11,
    "imageFilePath": "./image/11",
    "name": "Pad Thai",
    "reviewStar": 4.7,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 1,
    "publishDate": "22/10/2024",
    "cookTime": "25 phút",
    "description": "Pad Thai là món ăn truyền thống của Thái Lan, với sợi mì xào cùng tôm, đậu phụ, trứng, và nước sốt chua ngọt đặc trưng. Món này mang hương vị hài hòa giữa vị ngọt, mặn và chua, kèm theo chút cay nhẹ từ ớt, tạo nên một món ăn đầy hấp dẫn và giàu dinh dưỡng.",
    "ingredients": [
      "mì gạo",
      "tôm",
      "đậu phụ",
      "trứng",
      "nước mắm",
      "nước cốt chanh",
      "đậu phộng rang"
    ],
    "procedure": [
      "Ngâm mì gạo trong nước cho mềm, sau đó để ráo.",
      "Xào tôm và đậu phụ cho đến khi chín vàng.",
      "Đập trứng vào chảo, khuấy đều cùng tôm và đậu phụ.",
      "Cho mì gạo vào xào với nước mắm và nước cốt chanh.",
      "Rắc đậu phộng rang lên trên và thưởng thức."
    ],
    "comments": [
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Pad Thai ngon đúng vị Thái! Vị chua ngọt rất hợp."
      },
      {
        "userName": "Alice",
        "reviewStar": 4,
        "commentText": "Món này dễ làm nhưng hơi mặn với khẩu vị của mình."
      },
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Rất ngon và đủ vị, sẽ làm lại lần nữa!"
      },
      {
        "userName": "Emma",
        "reviewStar": 5,
        "commentText": "Pad Thai rất thơm ngon, dễ ăn và hợp với mọi người."
      }
    ]
  },
  {
    "id": 12,
    "imageFilePath": "./image/12",
    "name": "Ratatouille",
    "reviewStar": 4.8,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 1,
    "publishDate": "22/10/2024",
    "cookTime": "40 phút",
    "description": "Ratatouille là món ăn truyền thống của Pháp, với các loại rau củ nướng như cà chua, cà tím, ớt chuông và bí xanh. Món này không chỉ giàu vitamin và chất xơ mà còn mang hương vị thanh mát và đậm đà từ các loại rau củ tươi ngon, nướng đến khi mềm và thơm.",
    "ingredients": [
      "cà chua",
      "cà tím",
      "ớt chuông",
      "bí xanh",
      "tỏi",
      "dầu ô liu",
      "húng quế"
    ],
    "procedure": [
      "Cắt tất cả các loại rau củ thành lát mỏng.",
      "Xếp xen kẽ các lát rau củ trong khay nướng.",
      "Rưới dầu ô liu và rắc tỏi lên trên.",
      "Nướng ở nhiệt độ cao cho đến khi rau củ mềm và thơm.",
      "Trang trí với lá húng quế và thưởng thức."
    ],
    "comments": [
      {
        "userName": "Bob",
        "reviewStar": 5,
        "commentText": "Ratatouille rất thơm ngon, rau củ mềm và thấm gia vị!"
      },
      {
        "userName": "Gina",
        "reviewStar": 4,
        "commentText": "Món ăn rất tươi ngon và bổ dưỡng, nhưng hơi nhạt."
      },
      {
        "userName": "Dave",
        "reviewStar": 5,
        "commentText": "Một món ăn nhẹ nhàng, tuyệt vời cho bữa tối!"
      }
    ]
  },
  {
    "id": 13,
    "imageFilePath": "./image/13",
    "name": "Falafel",
    "reviewStar": 4.6,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 1,
    "publishDate": "22/10/2024",
    "cookTime": "30 phút",
    "description": "Falafel là món ăn truyền thống của Trung Đông, được làm từ đậu gà xay nhuyễn, trộn với các loại gia vị như thì là, tỏi, và rau mùi. Những viên falafel giòn rụm, thơm lừng, thường được ăn kèm với bánh mì pita, rau sống và sốt tahini, tạo nên một bữa ăn giàu protein và hương vị đặc trưng.",
    "ingredients": [
      "đậu gà",
      "thì là",
      "tỏi",
      "rau mùi",
      "bánh mì pita",
      "sốt tahini"
    ],
    "procedure": [
      "Ngâm đậu gà qua đêm, sau đó xay nhuyễn cùng tỏi và rau mùi.",
      "Thêm gia vị thì là và trộn đều hỗn hợp.",
      "Nặn hỗn hợp thành từng viên nhỏ và chiên đến khi giòn.",
      "Ăn kèm falafel với bánh mì pita, rau sống và sốt tahini."
    ],
    "comments": [
      {
        "userName": "Fred",
        "reviewStar": 4,
        "commentText": "Falafel giòn rụm, nhưng hơi khô, cần thêm sốt tahini."
      },
      {
        "userName": "Alice",
        "reviewStar": 5,
        "commentText": "Món này siêu ngon và dễ ăn, falafel giòn và thơm!"
      },
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Falafel ngon đúng kiểu Trung Đông, ăn rất lạ miệng!"
      }
    ]
  },
  {
    "id": 14,
    "imageFilePath": "./image/14",
    "name": "Sushi rau củ quả",
    "reviewStar": 4.8,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 1,
    "publishDate": "22/10/2024",
    "cookTime": "50 phút",
    "description": "Sushi rau quả là món ăn không kém cạnh khi so với sushi truyền thống, bao gồm cơm trộn giấm kết hợp với các loại rau củ quả như cà rốt, dưa chuột, rong biển v.v. Sushi mang hương vị tươi mát, thanh khiết, là sự kết hợp hoàn hảo giữa vị mặn của hải sản và vị chua nhẹ của cơm giấm.",
    "ingredients": [
      "cơm sushi",
      "giấm gạo",
      "cà rốt",
      "dưa chuột",
      "rong biển",
      "gừng muối",
      "wasabi"
    ],
    "procedure": [
      "Nấu cơm sushi và trộn đều với giấm gạo.",
      "Cắt hải sản tươi thành lát mỏng.",
      "Đặt cơm sushi lên tấm rong biển và xếp rau quả lên trên.",
      "Cuộn lại và cắt thành từng miếng vừa ăn.",
      "Thưởng thức cùng gừng muối và wasabi."
    ],
    "comments": [
      {
        "userName": "Emma",
        "reviewStar": 5,
        "commentText": "Sushi tươi ngon và chuẩn vị Nhật, mình rất thích!"
      },
      {
        "userName": "Harry",
        "reviewStar": 4,
        "commentText": "Sushi ngon nhưng cách cuộn chưa được chặt lắm."
      },
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Một món ăn tuyệt vời cho những ai yêu thích hải sản tươi!"
      }
    ]
  },
  {
    "id": 15,
    "imageFilePath": "./image/15",
    "name": "Paella",
    "reviewStar": 4.7,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 1,
    "publishDate": "22/10/2024",
    "cookTime": "60 phút",
    "description": "Paella là món cơm nổi tiếng của Tây Ban Nha, được nấu với hải sản, thịt gà, và gia vị nghệ tây. Món này có màu vàng bắt mắt, hương vị đậm đà của hải sản, kết hợp với cơm dẻo và gia vị độc đáo. Đây là món ăn hoàn hảo cho các dịp họp mặt gia đình hay bạn bè.",
    "ingredients": [
      "gạo",
      "tôm",
      "mực",
      "thịt gà",
      "nghệ tây",
      "ớt chuông",
      "đậu Hà Lan"
    ],
    "procedure": [
      "Chiên thịt gà cho đến khi chín vàng, sau đó thêm tôm và mực vào.",
      "Cho gạo vào nồi và trộn đều với nghệ tây.",
      "Đổ nước và nấu cơm cho đến khi chín mềm.",
      "Khi cơm đã chín, thêm ớt chuông và đậu Hà Lan vào nấu cùng.",
      "Trang trí với tôm và mực nướng và thưởng thức."
    ],
    "comments": [
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Paella thơm ngon, gia vị đậm đà và rất hợp khẩu vị!"
      },
      {
        "userName": "Fred",
        "reviewStar": 4,
        "commentText": "Món này ngon nhưng hơi tốn thời gian nấu."
      },
      {
        "userName": "Dave",
        "reviewStar": 5,
        "commentText": "Hải sản tươi và cơm dẻo, món ăn thật sự hoàn hảo!"
      },
      {
        "userName": "Claire",
        "reviewStar": 4,
        "commentText": "Món ăn đậm vị nhưng mình thích cơm mềm hơn một chút."
      }
    ]
  },
  {
    "id": 16,
    "imageFilePath": "./image/16",
    "name": "Tacos",
    "reviewStar": 4.9,
    "reviewCount": 2,
    "viewCount": 12,
    "authorId": 1,
    "publishDate": "22/10/2024",
    "cookTime": "20 phút",
    "description": "Tacos là món ăn truyền thống của Mexico, được làm từ bánh tortilla cuốn nhân thịt bò, gà, hoặc cá, kèm theo các loại rau sống như xà lách, cà chua, và hành tây. Món ăn này có hương vị đậm đà từ gia vị Mexico, kết hợp với độ giòn của bánh và độ tươi của rau.",
    "ingredients": [
      "bánh tortilla",
      "thịt bò",
      "xà lách",
      "cà chua",
      "hành tây",
      "phô mai",
      "sốt salsa"
    ],
    "procedure": [
      "Chiên thịt bò với gia vị Mexico cho đến khi chín.",
      "Đặt thịt bò lên bánh tortilla, kèm theo xà lách, cà chua và hành tây.",
      "Rắc phô mai lên trên và cuộn bánh lại.",
      "Thưởng thức tacos cùng sốt salsa."
    ],
    "comments": [
      {
        "userName": "Bob",
        "reviewStar": 5,
        "commentText": "Tacos đậm vị Mexico, ngon không thể tả!"
      },
      {
        "userName": "Alice",
        "reviewStar": 5,
        "commentText": "Một món ăn hoàn hảo cho bữa ăn nhanh, giòn và đầy hương vị!"
      }
    ]
  },
  {
    "id": 17,
    "imageFilePath": "./image/17",
    "name": "Spaghetti Carbonara",
    "reviewStar": 4.8,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 1,
    "publishDate": "22/10/2024",
    "cookTime": "30 phút",
    "description": "Spaghetti Carbonara là món mì Ý nổi tiếng với sự kết hợp hoàn hảo giữa mì spaghetti, trứng, phô mai Parmesan và thịt xông khói. Món ăn có vị béo ngậy từ trứng và phô mai, kết hợp với hương vị thơm lừng của thịt xông khói, tạo nên sự tinh tế và đậm đà trong từng sợi mì.",
    "ingredients": [
      "mì spaghetti",
      "thịt xông khói",
      "trứng",
      "phô mai Parmesan",
      "tỏi",
      "tiêu đen"
    ],
    "procedure": [
      "Luộc mì spaghetti cho đến khi chín mềm, sau đó để ráo nước.",
      "Chiên thịt xông khói đến khi giòn, sau đó thêm tỏi vào xào thơm.",
      "Đánh trứng cùng phô mai Parmesan và tiêu đen.",
      "Trộn mì với thịt xông khói và hỗn hợp trứng phô mai.",
      "Rắc thêm phô mai và thưởng thức."
    ],
    "comments": [
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Carbonara béo ngậy, đúng chuẩn vị Ý, rất tuyệt vời!"
      },
      {
        "userName": "Emma",
        "reviewStar": 4,
        "commentText": "Món này ngon nhưng mình cảm thấy hơi nhiều phô mai."
      },
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Rất ngon, hương vị tinh tế và dễ làm tại nhà!"
      }
    ]
  },
  {
    "id": 18,
    "imageFilePath": "./image/18.jfif",
    "name": "Gà nướng mật ong",
    "reviewStar": 4.9,
    "reviewCount": 6,
    "viewCount": 12,
    "authorId": 1,
    "publishDate": "22/10/2024",
    "cookTime": "1 giờ",
    "description": "Gà nướng mật ong là món ăn hấp dẫn với thịt gà được ướp gia vị và mật ong, sau đó nướng cho đến khi vàng ươm. Món ăn này không chỉ có vị ngọt từ mật ong mà còn có hương thơm tuyệt vời, rất thích hợp cho bữa tiệc hoặc bữa tối gia đình. Dùng kèm với rau sống và cơm, món này chắc chắn sẽ khiến mọi người hài lòng.",
    "ingredients": [
      "thịt gà",
      "mật ong",
      "tỏi băm",
      "nước tương",
      "muối",
      "tiêu",
      "dầu ăn",
      "gừng"
    ],
    "procedure": [
      "Rửa sạch thịt gà và để ráo nước.",
      "Trộn mật ong, tỏi băm, nước tương, muối, tiêu, và gừng để làm nước ướp.",
      "Ướp thịt gà với hỗn hợp trên trong khoảng 30 phút để gia vị thấm đều.",
      "Đun nóng lò nướng ở 200 độ C và đặt gà lên vỉ nướng.",
      "Nướng gà trong khoảng 40 phút, trở mặt thường xuyên để gà chín đều và có màu vàng hấp dẫn.",
      "Dọn gà ra đĩa và thưởng thức với rau sống và cơm."
    ],
    "comments": [
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Gà nướng mật ong thật tuyệt, vị ngọt và thơm!"
      },
      {
        "userName": "Dave",
        "reviewStar": 5,
        "commentText": "Món này rất ngon, mình đã làm cho gia đình và mọi người rất thích!"
      },
      {
        "userName": "Bob",
        "reviewStar": 4,
        "commentText": "Mình thích cách ướp này, nhưng có thể thêm chút ớt cho thêm vị cay."
      },
      {
        "userName": "Emma",
        "reviewStar": 5,
        "commentText": "Rất dễ làm và ngon, mình sẽ làm lại nhiều lần!"
      },
      {
        "userName": "Ivy",
        "reviewStar": 4,
        "commentText": "Một món ăn tuyệt vời, nhưng nên nướng thêm chút thời gian cho giòn hơn."
      },
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Chưa bao giờ ăn món gà nướng nào ngon như vậy, rất tuyệt!"
      }
    ]
  },
  {
    "id": 19,
    "imageFilePath": "./image/19",
    "name": "Tom Yum",
    "reviewStar": 4.7,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 1,
    "publishDate": "22/10/2024",
    "cookTime": "35 phút",
    "description": "Tom Yum là món canh chua cay nổi tiếng của Thái Lan, được nấu từ tôm tươi, nấm, sả, lá chanh và nước cốt chanh. Món ăn có hương vị đặc trưng với vị chua của chanh, cay nồng của ớt và mùi thơm của sả, lá chanh, tạo nên một món canh đầy sức hút và hấp dẫn.",
    "ingredients": [
      "tôm tươi",
      "nấm",
      "sả",
      "lá chanh",
      "ớt",
      "nước cốt chanh",
      "ngò rí"
    ],
    "procedure": [
      "Đun sôi nước và cho sả, lá chanh, ớt vào để tạo mùi thơm.",
      "Cho tôm tươi và nấm vào nấu đến khi chín.",
      "Thêm nước cốt chanh vào nồi, nêm nếm gia vị vừa ăn.",
      "Múc canh ra bát và rắc ngò rí lên trên.",
      "Thưởng thức Tom Yum khi còn nóng."
    ],
    "comments": [
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Tom Yum chua cay đúng vị Thái Lan, rất ngon!"
      },
      {
        "userName": "Dave",
        "reviewStar": 4,
        "commentText": "Món canh ngon nhưng hơi cay với mình."
      },
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Hương vị cay chua rất đặc biệt, mình rất thích món này!"
      }
    ]
  },
  {
    "id": 20,
    "imageFilePath": "./image/20",
    "name": "Bánh Croissant",
    "reviewStar": 4.9,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 1,
    "publishDate": "22/10/2024",
    "cookTime": "90 phút",
    "description": "Bánh Croissant là loại bánh ngọt nổi tiếng của Pháp, có hình lưỡi liềm với lớp vỏ giòn tan, bên trong mềm mại. Được làm từ bột mì, bơ, men và đường, Croissant có hương vị thơm ngậy của bơ và sự xốp nhẹ đặc trưng, là món bánh lý tưởng cho bữa sáng hoặc những buổi trà chiều.",
    "ingredients": [
      "bột mì",
      "bơ",
      "đường",
      "men",
      "sữa tươi",
      "muối"
    ],
    "procedure": [
      "Trộn bột mì, men, đường, muối và sữa thành hỗn hợp dẻo mịn.",
      "Để bột nghỉ và cán mỏng, sau đó gấp bơ vào trong lớp bột.",
      "Cán và gấp bột nhiều lần để tạo lớp bột xốp.",
      "Cuộn bột thành hình lưỡi liềm và để bột nghỉ lần cuối.",
      "Nướng bánh ở nhiệt độ 180°C cho đến khi bánh vàng giòn."
    ],
    "comments": [
      {
        "userName": "Emma",
        "reviewStar": 5,
        "commentText": "Bánh Croissant thơm ngon và giòn tan, rất giống với bánh Pháp chính gốc!"
      },
      {
        "userName": "Bob",
        "reviewStar": 5,
        "commentText": "Lớp vỏ giòn, bên trong mềm mịn, món này thực sự tuyệt vời!"
      },
      {
        "userName": "Alice",
        "reviewStar": 4,
        "commentText": "Bánh ngon nhưng mình thấy hơi nhiều bơ."
      },
      {
        "userName": "Dave",
        "reviewStar": 5,
        "commentText": "Croissant xốp và thơm ngậy, rất thích hợp để ăn sáng."
      }
    ]
  },
  {
    "id": 21,
    "imageFilePath": "./image/21",
    "name": "Biryani",
    "reviewStar": 4.8,
    "reviewCount": 5,
    "viewCount": 12,
    "authorId": 2,
    "publishDate": "22/10/2024",
    "cookTime": "60 phút",
    "description": "Biryani là món cơm thảo mộc truyền thống của Ấn Độ, được nấu với thịt gia cầm hoặc thịt cừu, hương vị thơm ngon từ gia vị như nghệ, quế và hạt tiêu. Món ăn nổi bật với lớp cơm vàng, đậm đà, kết hợp cùng thịt mềm và các loại rau củ tươi ngon, tạo nên một bữa ăn hấp dẫn và đầy màu sắc.",
    "ingredients": [
      "gạo basmati",
      "thịt gà",
      "hành tây",
      "tỏi",
      "gừng",
      "gia vị (quế, hạt tiêu, nghệ)",
      "rau mùi"
    ],
    "procedure": [
      "Rang gạo basmati và nấu với nước cho đến khi gần chín.",
      "Chiên hành tây cho đến khi vàng và thêm tỏi, gừng vào xào thơm.",
      "Thêm thịt gà và gia vị vào nồi, nấu cho đến khi thịt chín.",
      "Xếp lớp gạo lên trên thịt và nấu chín trong nồi kín.",
      "Rắc rau mùi lên và thưởng thức khi còn nóng."
    ],
    "comments": [
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Biryani tuyệt vời, hương vị thơm ngon và đậm đà!"
      },
      {
        "userName": "Fred",
        "reviewStar": 4,
        "commentText": "Món ăn ngon nhưng mình thấy hơi nhiều gia vị."
      },
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Món cơm đặc biệt, ăn cùng thịt gà rất hợp!"
      },
      {
        "userName": "Harry",
        "reviewStar": 5,
        "commentText": "Một món ăn đầy hương vị, mình sẽ làm lại nhiều lần!"
      },
      {
        "userName": "Bob",
        "reviewStar": 4,
        "commentText": "Biryani ngon nhưng hơi tốn thời gian nấu."
      }
    ]
  },
  {
    "id": 22,
    "imageFilePath": "./image/22",
    "name": "Pasta Pesto",
    "reviewStar": 4.7,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 2,
    "publishDate": "22/10/2024",
    "cookTime": "25 phút",
    "description": "Pasta Pesto là món ăn truyền thống của Ý, nổi bật với nước sốt pesto được làm từ húng quế tươi, hạt thông và phô mai Parmesan. Món này mang đến hương vị tươi mát, đậm đà, thích hợp cho những bữa ăn nhanh chóng nhưng vẫn đầy đủ chất dinh dưỡng.",
    "ingredients": [
      "mì pasta",
      "húng quế tươi",
      "hạt thông",
      "phô mai Parmesan",
      "tỏi",
      "dầu ô liu"
    ],
    "procedure": [
      "Luộc mì pasta cho đến khi chín và để ráo nước.",
      "Xay nhuyễn húng quế, hạt thông, tỏi và phô mai Parmesan với dầu ô liu.",
      "Trộn mì với nước sốt pesto cho đều.",
      "Rắc thêm phô mai và tiêu lên trên trước khi thưởng thức."
    ],
    "comments": [
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Pasta Pesto rất ngon, hương vị tươi mát tuyệt vời!"
      },
      {
        "userName": "Emma",
        "reviewStar": 4,
        "commentText": "Món này dễ làm nhưng mình muốn có thêm chút thịt."
      },
      {
        "userName": "Alice",
        "reviewStar": 4,
        "commentText": "Hương vị rất đặc trưng, nhưng hơi ngán nếu ăn nhiều."
      }
    ]
  },
  {
    "id": 23,
    "imageFilePath": "./image/23",
    "name": "Chili Con Carne",
    "reviewStar": 4.6,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 2,
    "publishDate": "22/10/2024",
    "cookTime": "50 phút",
    "description": "Chili Con Carne là món ăn phổ biến của Mexico, được chế biến từ thịt bò xay, đậu đỏ và các loại gia vị cay. Món này mang hương vị đậm đà, cay nồng, thường được ăn kèm với cơm hoặc bánh tortilla, là lựa chọn tuyệt vời cho những bữa tiệc hoặc bữa ăn gia đình.",
    "ingredients": [
      "thịt bò xay",
      "đậu đỏ",
      "hành tây",
      "tỏi",
      "gia vị (ớt bột, bột thì là)",
      "nước dùng",
      "bánh tortilla"
    ],
    "procedure": [
      "Chiên hành tây và tỏi cho đến khi thơm.",
      "Thêm thịt bò vào xào chín, sau đó thêm gia vị và đậu đỏ.",
      "Đổ nước dùng vào và nấu nhỏ lửa trong khoảng 30 phút.",
      "Thưởng thức cùng cơm hoặc bánh tortilla."
    ],
    "comments": [
      {
        "userName": "Dave",
        "reviewStar": 5,
        "commentText": "Chili Con Carne ngon tuyệt, rất đậm đà và cay!"
      },
      {
        "userName": "Fred",
        "reviewStar": 4,
        "commentText": "Món này cay quá, nhưng vẫn rất ngon."
      },
      {
        "userName": "Bob",
        "reviewStar": 4,
        "commentText": "Chili có vị đậm đà, ăn kèm với cơm rất hợp!"
      },
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Rất thích món này, chuẩn vị Mexico!"
      }
    ]
  },
  {
    "id": 24,
    "imageFilePath": "./image/24",
    "name": "Tacos",
    "reviewStar": 4.7,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 2,
    "publishDate": "22/10/2024",
    "cookTime": "30 phút",
    "description": "Tacos là món ăn đặc trưng của Mexico, bao gồm bánh tortilla cuốn quanh nhân thịt, rau củ và sốt salsa. Món ăn này có thể tùy chỉnh với nhiều loại nhân khác nhau như thịt bò, gà, đậu và rau, tạo nên sự đa dạng và phong phú trong hương vị, rất thích hợp cho những bữa tiệc hoặc bữa ăn gia đình.",
    "ingredients": [
      "bánh tortilla",
      "thịt bò",
      "xà lách",
      "cà chua",
      "sốt salsa",
      "phô mai"
    ],
    "procedure": [
      "Chiên thịt bò cho đến khi chín và nêm nếm gia vị.",
      "Đặt bánh tortilla lên đĩa và thêm thịt, rau và sốt salsa lên trên.",
      "Rắc phô mai và xà lách lên trên để tăng thêm hương vị.",
      "Cuộn bánh tortilla lại và thưởng thức."
    ],
    "comments": [
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Tacos rất ngon, hương vị tươi mát và đậm đà!"
      },
      {
        "userName": "Emma",
        "reviewStar": 4,
        "commentText": "Món này dễ làm nhưng mình muốn có thêm sốt cay."
      },
      {
        "userName": "Claire",
        "reviewStar": 4,
        "commentText": "Rất thích cách cuốn này, dễ ăn và ngon miệng."
      },
      {
        "userName": "Harry",
        "reviewStar": 5,
        "commentText": "Tacos chuẩn vị Mexico, một món ăn lý tưởng!"
      }
    ]
  },
  {
    "id": 25,
    "imageFilePath": "./image/25",
    "name": "Moussaka",
    "reviewStar": 4.6,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 2,
    "publishDate": "22/10/2024",
    "cookTime": "90 phút",
    "description": "Moussaka là món ăn truyền thống của Hy Lạp, làm từ lớp khoai tây, thịt xay và cà tím, được phủ lớp sốt béchamel trên cùng. Món ăn này có hương vị phong phú, kết hợp giữa các nguyên liệu tươi ngon, thường được nướng trong lò cho đến khi vàng đều và thơm lừng.",
    "ingredients": [
      "khoai tây",
      "thịt cừu xay",
      "cà tím",
      "hành tây",
      "sốt béchamel",
      "phô mai"
    ],
    "procedure": [
      "Luộc khoai tây và cắt thành lát mỏng.",
      "Chiên cà tím cho đến khi mềm và vàng.",
      "Xào thịt cừu với hành tây và gia vị.",
      "Xếp lớp khoai tây, thịt cừu và cà tím vào khay nướng, phủ sốt béchamel lên trên.",
      "Nướng trong lò cho đến khi vàng và hấp dẫn."
    ],
    "comments": [
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Moussaka thật tuyệt vời, hương vị thơm ngon và rất phong phú!"
      },
      {
        "userName": "Fred",
        "reviewStar": 4,
        "commentText": "Món này hơi cầu kỳ nhưng rất đáng để thử."
      },
      {
        "userName": "Bob",
        "reviewStar": 4,
        "commentText": "Lớp sốt béchamel rất ngon, mình sẽ làm lại!"
      }
    ]
  },
  {
    "id": 26,
    "imageFilePath": "./image/26",
    "name": "Sushi",
    "reviewStar": 4.9,
    "reviewCount": 5,
    "viewCount": 12,
    "authorId": 2,
    "publishDate": "22/10/2024",
    "cookTime": "45 phút",
    "description": "Sushi là món ăn nổi tiếng của Nhật Bản, bao gồm cơm dẻo cuộn với cá tươi sống, rau củ và các nguyên liệu khác. Món ăn này không chỉ hấp dẫn về hương vị mà còn về hình thức, thường được ăn kèm với wasabi và nước tương, tạo nên sự hòa quyện tuyệt vời cho một bữa ăn độc đáo.",
    "ingredients": [
      "gạo sushi",
      "cá hồi",
      "cá ngừ",
      "rau dưa",
      "rong biển",
      "wasabi"
    ],
    "procedure": [
      "Nấu gạo sushi và để nguội.",
      "Cắt cá và rau thành lát mỏng.",
      "Trải rong biển ra và xếp gạo sushi lên trên.",
      "Đặt cá và rau lên gạo và cuộn chặt.",
      "Cắt sushi thành miếng vừa ăn và thưởng thức với nước tương."
    ],
    "comments": [
      {
        "userName": "Alice",
        "reviewStar": 5,
        "commentText": "Sushi tươi ngon, đúng vị Nhật Bản, rất thích!"
      },
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Món này rất đẹp mắt và hương vị tuyệt vời!"
      },
      {
        "userName": "Harry",
        "reviewStar": 4,
        "commentText": "Sushi ngon nhưng mình không thích wasabi lắm."
      },
      {
        "userName": "Emma",
        "reviewStar": 5,
        "commentText": "Hương vị tươi mát, mình rất thích ăn sushi!"
      },
      {
        "userName": "Claire",
        "reviewStar": 4,
        "commentText": "Sushi đẹp và ngon, nhưng hơi khó làm tại nhà."
      }
    ]
  },
  {
    "id": 27,
    "imageFilePath": "./image/27",
    "name": "Ratatouille",
    "reviewStar": 4.8,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 2,
    "publishDate": "22/10/2024",
    "cookTime": "60 phút",
    "description": "Ratatouille là món ăn truyền thống của Pháp, được làm từ nhiều loại rau củ như cà tím, bí ngòi, ớt chuông và cà chua, nấu chín cùng với các gia vị thơm ngon. Món ăn không chỉ bổ dưỡng mà còn rất hấp dẫn với màu sắc tươi sáng, thường được dùng như một món ăn chính hoặc ăn kèm với thịt.",
    "ingredients": [
      "cà tím",
      "bí ngòi",
      "ớt chuông",
      "cà chua",
      "hành tây",
      "tỏi",
      "dầu ô liu",
      "rau thơm"
    ],
    "procedure": [
      "Cắt rau củ thành miếng nhỏ và ướp với muối và tiêu.",
      "Chiên hành tây và tỏi trong dầu ô liu cho đến khi thơm.",
      "Thêm rau củ vào xào chín và nêm nếm gia vị.",
      "Nấu cho đến khi rau củ mềm và tất cả hương vị hòa quyện.",
      "Thưởng thức món ăn khi còn nóng, có thể rắc thêm rau thơm lên trên."
    ],
    "comments": [
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Ratatouille rất ngon và bổ dưỡng, mình thích ăn kèm với bánh mì."
      },
      {
        "userName": "Fred",
        "reviewStar": 4,
        "commentText": "Món này thật tươi mát, nhưng mình muốn có thêm gia vị."
      },
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Hương vị tuyệt vời, rất thích hợp cho thực đơn chay!"
      },
      {
        "userName": "Bob",
        "reviewStar": 4,
        "commentText": "Rau củ tươi ngon, món này dễ làm và hấp dẫn!"
      }
    ]
  },
  {
    "id": 28,
    "imageFilePath": "./image/28",
    "name": "Phở gà",
    "reviewStar": 4.9,
    "reviewCount": 5,
    "viewCount": 12,
    "authorId": 2,
    "publishDate": "22/10/2024",
    "cookTime": "120 phút",
    "description": "Phở gà là món ăn truyền thống của Việt Nam, nổi tiếng với nước dùng thơm ngon, thịt gà mềm và bánh phở dai. Món ăn này thường được ăn kèm với rau thơm, giá đỗ và chanh, mang đến trải nghiệm ẩm thực đậm đà và phong phú cho thực khách. Phở gà không chỉ ngon mà còn chứa nhiều dinh dưỡng.",
    "ingredients": [
      "bánh phở",
      "thịt gà",
      "nước dùng",
      "hành tây",
      "gừng",
      "rau thơm",
      "giá đỗ",
      "chanh"
    ],
    "procedure": [
      "Ninh xương và gừng để tạo nước dùng trong khoảng 1-2 giờ.",
      "Thêm hành tây, gia vị vào nồi nước dùng để tăng hương vị.",
      "Luộc bánh phở và cho vào tô.",
      "Thêm thịt gà đã thái mỏng lên trên bánh phở.",
      "Rưới nước dùng nóng lên trên và thưởng thức cùng rau thơm, giá đỗ và chanh."
    ],
    "comments": [
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Phở gà ngon tuyệt, nước dùng rất đậm đà!"
      },
      {
        "userName": "Alice",
        "reviewStar": 5,
        "commentText": "Món ăn tuyệt vời, mình không thể cưỡng lại được!"
      },
      {
        "userName": "Harry",
        "reviewStar": 4,
        "commentText": "Nước dùng rất ngon, nhưng thịt bò hơi ít."
      },
      {
        "userName": "Emma",
        "reviewStar": 5,
        "commentText": "Rất thích ăn phở, món này mình sẽ làm thường xuyên."
      },
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Phở gà luôn là món ăn yêu thích của mình!"
      }
    ]
  },
  {
    "id": 29,
    "imageFilePath": "./image/29",
    "name": "Kebab",
    "reviewStar": 4.7,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 2,
    "publishDate": "22/10/2024",
    "cookTime": "40 phút",
    "description": "Kebab là món ăn đường phố nổi tiếng của các nước Trung Đông, gồm thịt nướng thơm ngon cuốn trong bánh pita cùng với rau sống và nước sốt. Món ăn này thường được chế biến từ thịt cừu, gà hoặc bò, tạo nên sự hòa quyện tuyệt vời giữa vị cay nồng và hương thơm của gia vị, rất phù hợp cho bữa ăn nhanh chóng và ngon miệng.",
    "ingredients": [
      "thịt cừu hoặc gà",
      "bánh pita",
      "rau sống (xà lách, cà chua, hành tây)",
      "nước sốt (tương ớt, sốt tỏi)",
      "gia vị (như bột quế, bột ớt)"
    ],
    "procedure": [
      "Marinade thịt với gia vị và để trong tủ lạnh khoảng 30 phút.",
      "Nướng thịt trên vỉ hoặc trong lò cho đến khi chín vàng.",
      "Đặt thịt nướng vào bánh pita và thêm rau sống, nước sốt.",
      "Cuộn bánh pita lại và thưởng thức ngay khi còn nóng."
    ],
    "comments": [
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Kebab ngon tuyệt, rất thích ăn kèm với sốt tỏi!"
      },
      {
        "userName": "Fred",
        "reviewStar": 4,
        "commentText": "Món này thật tuyệt vời, nhưng hơi nhiều dầu."
      },
      {
        "userName": "Bob",
        "reviewStar": 4,
        "commentText": "Kebab thơm ngon, dễ làm và hợp khẩu vị."
      },
      {
        "userName": "Dave",
        "reviewStar": 5,
        "commentText": "Một món ăn đường phố tuyệt vời, mình rất thích!"
      }
    ]
  },
  {
    "id": 30,
    "imageFilePath": "./image/30",
    "name": "Paella",
    "reviewStar": 4.8,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 2,
    "publishDate": "22/10/2024",
    "cookTime": "50 phút",
    "description": "Paella là món cơm truyền thống của Tây Ban Nha, nổi bật với hương vị đậm đà từ hải sản, thịt gà và rau củ. Món ăn này thường được nấu trong chảo rộng, giúp cơm chín đều và thấm đều gia vị. Với màu sắc hấp dẫn và hương thơm quyến rũ, paella trở thành món ăn lý tưởng cho những bữa tiệc hay các dịp đặc biệt.",
    "ingredients": [
      "gạo",
      "tôm",
      "mực",
      "gà",
      "đậu xanh",
      "ớt chuông",
      "hành tây",
      "tỏi",
      "gia vị (như saffron, muối, tiêu)"
    ],
    "procedure": [
      "Rang gạo với hành tây và tỏi cho đến khi thơm.",
      "Thêm nước dùng vào và để gạo hấp thụ nước.",
      "Thêm hải sản và thịt gà vào chảo khi gạo gần chín.",
      "Nấu cho đến khi hải sản chín và cơm mềm.",
      "Trang trí với ớt chuông và đậu xanh, thưởng thức khi còn nóng."
    ],
    "comments": [
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Paella thật tuyệt vời, hương vị rất phong phú!"
      },
      {
        "userName": "Alice",
        "reviewStar": 4,
        "commentText": "Món ăn này rất ngon, nhưng mình muốn có thêm hải sản."
      },
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Paella rất hấp dẫn và dễ làm, mình sẽ thử lại!"
      }
    ]
  },
  {
    "id": 31,
    "imageFilePath": "./image/31",
    "name": "Biryani",
    "reviewStar": 4.6,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 3,
    "publishDate": "22/10/2024",
    "cookTime": "70 phút",
    "description": "Biryani là món cơm thập cẩm nổi tiếng của Ấn Độ, được làm từ gạo basmati, thịt (thường là thịt gà hoặc cừu), cùng với các loại gia vị thơm ngon. Món ăn này không chỉ nổi bật với hương vị hấp dẫn mà còn với màu sắc rực rỡ, thường được phục vụ trong các dịp lễ hội và bữa tiệc.",
    "ingredients": [
      "gạo basmati",
      "thịt gà hoặc cừu",
      "hành tây",
      "tỏi",
      "gừng",
      "gia vị (như nghệ, bột ớt, thì là)",
      "rau thơm"
    ],
    "procedure": [
      "Ngâm gạo basmati trong nước khoảng 30 phút rồi để ráo.",
      "Chiên hành tây cho đến khi vàng và thơm, thêm tỏi, gừng vào xào.",
      "Thêm thịt và gia vị vào nấu cho đến khi thịt chín.",
      "Cho gạo vào nồi cùng với nước và nấu cho đến khi cơm chín mềm.",
      "Trang trí với rau thơm và thưởng thức khi còn nóng."
    ],
    "comments": [
      {
        "userName": "Harry",
        "reviewStar": 5,
        "commentText": "Biryani rất ngon, hương vị thật sự phong phú!"
      },
      {
        "userName": "Emma",
        "reviewStar": 4,
        "commentText": "Món ăn này rất thú vị nhưng hơi khó làm."
      },
      {
        "userName": "Bob",
        "reviewStar": 5,
        "commentText": "Biryani rất đậm đà, mình sẽ làm thường xuyên."
      },
      {
        "userName": "Ivy",
        "reviewStar": 4,
        "commentText": "Thích món này nhưng có thể thêm chút cay hơn."
      }
    ]
  },
  {
    "id": 32,
    "imageFilePath": "./image/32",
    "name": "Ceviche",
    "reviewStar": 4.7,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 3,
    "publishDate": "22/10/2024",
    "cookTime": "30 phút",
    "description": "Ceviche là món ăn đặc trưng của Peru, được làm từ hải sản tươi sống, thường là cá, được ướp với nước chanh và gia vị. Món ăn này không cần nấu chín, mà sự chua của nước chanh làm chín hải sản, mang đến hương vị tươi mát và hấp dẫn, rất phù hợp cho những ngày hè nóng bức.",
    "ingredients": [
      "cá tươi (như cá hồi hoặc cá ngừ)",
      "nước chanh",
      "hành tím",
      "ớt",
      "rau mùi",
      "muối"
    ],
    "procedure": [
      "Cắt cá thành từng miếng nhỏ và cho vào bát.",
      "Thêm nước chanh, hành tím, ớt và muối vào trộn đều.",
      "Để hỗn hợp trong tủ lạnh khoảng 15 phút cho cá ngấm gia vị.",
      "Rắc rau mùi lên trên và thưởng thức ngay."
    ],
    "comments": [
      {
        "userName": "Fred",
        "reviewStar": 5,
        "commentText": "Ceviche thật tươi ngon và rất hấp dẫn!"
      },
      {
        "userName": "Claire",
        "reviewStar": 4,
        "commentText": "Món này tuyệt vời, nhưng mình muốn có thêm ớt."
      },
      {
        "userName": "Alice",
        "reviewStar": 5,
        "commentText": "Hương vị tươi mát, mình sẽ làm lại ngay!"
      }
    ]
  },
  {
    "id": 33,
    "imageFilePath": "./image/33",
    "name": "Kimchi",
    "reviewStar": 4.5,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 3,
    "publishDate": "22/10/2024",
    "cookTime": "45 phút",
    "description": "Kimchi là món ăn truyền thống của Hàn Quốc, được làm từ rau cải thảo và gia vị, lên men tự nhiên. Món ăn này không chỉ mang đến hương vị đặc trưng mà còn rất tốt cho sức khỏe, thường được ăn kèm với cơm hoặc các món chính khác, mang đến sự cân bằng cho bữa ăn.",
    "ingredients": [
      "cải thảo",
      "tỏi",
      "gừng",
      "bột ớt Hàn Quốc",
      "đường",
      "muối"
    ],
    "procedure": [
      "Rửa sạch cải thảo và cắt thành từng miếng vừa ăn.",
      "Trộn tỏi, gừng, bột ớt, đường và muối thành hỗn hợp gia vị.",
      "Bôi hỗn hợp gia vị lên từng lá cải thảo và để trong lọ đậy kín.",
      "Để kimchi ở nhiệt độ phòng khoảng 1-2 ngày cho lên men, sau đó cho vào tủ lạnh."
    ],
    "comments": [
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Kimchi rất ngon và tốt cho sức khỏe, mình thích món này!"
      },
      {
        "userName": "Harry",
        "reviewStar": 4,
        "commentText": "Món này có vị hơi cay, nhưng rất thú vị!"
      },
      {
        "userName": "Emma",
        "reviewStar": 4,
        "commentText": "Kimchi rất hấp dẫn, nhưng hơi mặn một chút."
      },
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Kimchi tự làm thật tuyệt, hương vị thật sự khác biệt!"
      }
    ]
  },
  {
    "id": 34,
    "imageFilePath": "./image/34",
    "name": "Sushi",
    "reviewStar": 4.9,
    "reviewCount": 5,
    "viewCount": 12,
    "authorId": 3,
    "publishDate": "22/10/2024",
    "cookTime": "60 phút",
    "description": "Sushi là món ăn nổi tiếng của Nhật Bản, thường được làm từ cơm dẻo và hải sản tươi sống, được cuộn lại thành từng miếng nhỏ. Món ăn này không chỉ đẹp mắt mà còn chứa nhiều dinh dưỡng, thường được phục vụ kèm với wasabi và nước tương. Sushi đã trở thành một biểu tượng ẩm thực toàn cầu với hương vị tươi ngon và đa dạng.",
    "ingredients": [
      "cơm sushi",
      "cá hồi",
      "cá ngừ",
      "rau củ (như dưa leo, bơ)",
      "nori (tảo biển)",
      "wasabi",
      "nước tương"
    ],
    "procedure": [
      "Nấu cơm sushi theo tỷ lệ nước và gạo chính xác.",
      "Để cơm nguội và trộn với giấm sushi.",
      "Trải nori lên thớt và cho một lớp cơm lên trên.",
      "Thêm cá và rau củ vào giữa, cuộn chặt tay.",
      "Cắt sushi thành miếng vừa ăn và thưởng thức cùng wasabi và nước tương."
    ],
    "comments": [
      {
        "userName": "Alice",
        "reviewStar": 5,
        "commentText": "Sushi thật tuyệt vời, tươi ngon và rất hấp dẫn!"
      },
      {
        "userName": "Fred",
        "reviewStar": 4,
        "commentText": "Rất thích sushi, nhưng hơi khó làm một chút."
      },
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Món ăn này rất ngon, mình sẽ làm thường xuyên!"
      },
      {
        "userName": "Ivy",
        "reviewStar": 4,
        "commentText": "Hơi nhiều cơm, nhưng vẫn rất ngon!"
      },
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Một món ăn tuyệt vời, mình thích ăn sushi!"
      }
    ]
  },
  {
    "id": 35,
    "imageFilePath": "./image/35",
    "name": "Tacos",
    "reviewStar": 4.8,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 3,
    "publishDate": "22/10/2024",
    "cookTime": "30 phút",
    "description": "Tacos là món ăn đường phố nổi tiếng của Mexico, thường được làm từ bánh tortilla mềm hoặc giòn, được nhồi với thịt, rau củ và các loại gia vị. Món ăn này mang đến hương vị phong phú và thường được ăn kèm với sốt salsa hoặc guacamole, tạo nên trải nghiệm ẩm thực thú vị và đa dạng.",
    "ingredients": [
      "bánh tortilla",
      "thịt bò hoặc gà",
      "rau sống (xà lách, cà chua)",
      "phô mai",
      "salsa",
      "bơ"
    ],
    "procedure": [
      "Nướng bánh tortilla cho đến khi nóng và mềm.",
      "Xào thịt với gia vị cho đến khi chín.",
      "Đặt thịt vào giữa bánh tortilla và thêm rau sống, phô mai.",
      "Rưới salsa và thêm một ít bơ lên trên, cuộn lại và thưởng thức."
    ],
    "comments": [
      {
        "userName": "Emma",
        "reviewStar": 5,
        "commentText": "Tacos rất ngon và thú vị, một món ăn tuyệt vời!"
      },
      {
        "userName": "Bob",
        "reviewStar": 4,
        "commentText": "Món này rất dễ làm và hợp khẩu vị, mình thích!"
      },
      {
        "userName": "Dave",
        "reviewStar": 4,
        "commentText": "Tacos ngon, nhưng mình thích thêm nhiều gia vị hơn."
      },
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Một món ăn nhanh chóng và rất ngon miệng!"
      }
    ]
  },
  {
    "id": 36,
    "imageFilePath": "./image/36",
    "name": "Baklava",
    "reviewStar": 4.7,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 3,
    "publishDate": "22/10/2024",
    "cookTime": "90 phút",
    "description": "Baklava là món tráng miệng truyền thống của các nước Trung Đông, được làm từ lớp bột phyllo, nhân hạt và mật ong. Món ăn này có vị ngọt và độ giòn tuyệt vời, thường được thưởng thức vào các dịp lễ hội. Baklava là sự kết hợp hoàn hảo giữa hương vị và kết cấu, mang lại trải nghiệm ẩm thực độc đáo.",
    "ingredients": [
      "bột phyllo",
      "hạt óc chó hoặc hạt hạnh nhân",
      "mật ong",
      "đường",
      "bơ",
      "cinnamon (bột quế)"
    ],
    "procedure": [
      "Bôi bơ lên từng lớp bột phyllo và xếp chồng lên nhau.",
      "Rải hạt đã nghiền vào giữa các lớp bột.",
      "Cắt baklava thành hình vuông và nướng cho đến khi vàng giòn.",
      "Rưới mật ong và đường lên trên khi bánh còn nóng."
    ],
    "comments": [
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Baklava thật sự ngon, rất ngọt và giòn!"
      },
      {
        "userName": "Harry",
        "reviewStar": 4,
        "commentText": "Món này rất thơm và ngon, nhưng hơi ngọt."
      },
      {
        "userName": "Fred",
        "reviewStar": 4,
        "commentText": "Baklava là một món tráng miệng tuyệt vời, mình rất thích!"
      }
    ]
  },
  {
    "id": 37,
    "imageFilePath": "./image/37",
    "name": "Chili con carne",
    "reviewStar": 4.8,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 3,
    "publishDate": "22/10/2024",
    "cookTime": "90 phút",
    "description": "Chili con carne là món ăn truyền thống của Mỹ, thường được làm từ thịt bò, đậu, và các loại gia vị cay. Món ăn này không chỉ đậm đà mà còn rất bổ dưỡng, thường được dùng kèm với cơm hoặc bánh mì. Chili con carne trở thành món ăn yêu thích trong các buổi tiệc và bữa tối gia đình.",
    "ingredients": [
      "thịt bò xay",
      "đậu đỏ",
      "hành tây",
      "tỏi",
      "bột ớt",
      "gia vị (như muối, tiêu, thì là)",
      "salsa"
    ],
    "procedure": [
      "Xào hành tây và tỏi cho thơm, sau đó thêm thịt bò vào xào cho đến khi chín.",
      "Thêm đậu, salsa và gia vị vào nồi, khuấy đều.",
      "Đun nhỏ lửa trong khoảng 30-40 phút cho các hương vị hòa quyện.",
      "Thưởng thức với cơm hoặc bánh mì, trang trí với rau mùi."
    ],
    "comments": [
      {
        "userName": "Alice",
        "reviewStar": 5,
        "commentText": "Chili con carne thật tuyệt vời, rất ngon và cay!"
      },
      {
        "userName": "Emma",
        "reviewStar": 4,
        "commentText": "Món này rất hấp dẫn nhưng hơi cay một chút."
      },
      {
        "userName": "Claire",
        "reviewStar": 4,
        "commentText": "Rất thích món này, ăn kèm với cơm rất ngon!"
      },
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Một món ăn lý tưởng cho bữa tối, rất thích!"
      }
    ]
  },
  {
    "id": 38,
    "imageFilePath": "./image/38",
    "name": "Ratatouille",
    "reviewStar": 4.6,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 3,
    "publishDate": "22/10/2024",
    "cookTime": "50 phút",
    "description": "Ratatouille là món ăn truyền thống của Pháp, được làm từ các loại rau củ tươi sống như cà tím, bí ngòi, và ớt chuông. Món ăn này thường được nấu chín từ từ để các hương vị hòa quyện với nhau, mang lại một hương vị tươi mát và hấp dẫn. Ratatouille là sự lựa chọn tuyệt vời cho những ai yêu thích ẩm thực chay.",
    "ingredients": [
      "cà tím",
      "bí ngòi",
      "ớt chuông",
      "cà chua",
      "hành tây",
      "tỏi",
      "gia vị (như muối, tiêu, thyme)"
    ],
    "procedure": [
      "Cắt tất cả các loại rau thành miếng vừa ăn.",
      "Xào hành tây và tỏi cho thơm, sau đó thêm các loại rau vào nồi.",
      "Nêm nếm với muối, tiêu và thyme, đảo đều.",
      "Nấu ở lửa nhỏ trong khoảng 30 phút cho rau mềm.",
      "Thưởng thức nóng hoặc nguội, có thể dùng kèm với bánh mì."
    ],
    "comments": [
      {
        "userName": "Harry",
        "reviewStar": 5,
        "commentText": "Ratatouille rất ngon, mình thích hương vị tự nhiên!"
      },
      {
        "userName": "Bob",
        "reviewStar": 4,
        "commentText": "Món này dễ làm và rất bổ dưỡng!"
      },
      {
        "userName": "Ivy",
        "reviewStar": 4,
        "commentText": "Rất thích món ăn này, một sự lựa chọn tuyệt vời!"
      }
    ]
  },
  {
    "id": 39,
    "imageFilePath": "./image/39",
    "name": "Pasta Carbonara",
    "reviewStar": 4.9,
    "reviewCount": 5,
    "viewCount": 12,
    "authorId": 3,
    "publishDate": "22/10/2024",
    "cookTime": "30 phút",
    "description": "Pasta Carbonara là món pasta nổi tiếng của Ý, được làm từ mì spaghetti, trứng, phô mai Pecorino Romano, và thịt xông khói. Món ăn này nổi bật với hương vị béo ngậy và độ kem mịn màng, thường được phục vụ nóng và rất được yêu thích trong các bữa ăn gia đình.",
    "ingredients": [
      "mì spaghetti",
      "trứng",
      "phô mai Pecorino Romano",
      "thịt xông khói",
      "tiêu đen",
      "muối"
    ],
    "procedure": [
      "Nấu mì spaghetti theo hướng dẫn trên bao bì cho đến khi chín.",
      "Trong khi đó, chiên thịt xông khói cho đến khi giòn.",
      "Trộn trứng và phô mai trong một bát lớn.",
      "Khi mì chín, trộn mì với thịt xông khói và sau đó thêm hỗn hợp trứng vào.",
      "Khuấy đều và thưởng thức ngay khi còn nóng."
    ],
    "comments": [
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Pasta Carbonara thật tuyệt vời, béo ngậy và ngon!"
      },
      {
        "userName": "Emma",
        "reviewStar": 4,
        "commentText": "Rất thích món này, nhưng mình muốn thêm nhiều thịt hơn."
      },
      {
        "userName": "Dave",
        "reviewStar": 4,
        "commentText": "Món ăn dễ làm và rất ngon miệng!"
      },
      {
        "userName": "Fred",
        "reviewStar": 5,
        "commentText": "Carbonara là món yêu thích của mình, rất tuyệt!"
      }
    ]
  },
  {
    "id": 40,
    "imageFilePath": "./image/40",
    "name": "Bánh crepes",
    "reviewStar": 4.7,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 3,
    "publishDate": "22/10/2024",
    "cookTime": "40 phút",
    "description": "Bánh crepes là món bánh mỏng truyền thống của Pháp, có thể được làm ngọt hoặc mặn tùy theo sở thích. Bánh thường được nhân với kem, trái cây, hoặc thịt và rau củ. Với độ mềm mịn và hương vị phong phú, bánh crepes trở thành một món ăn tuyệt vời cho bữa sáng hoặc tráng miệng.",
    "ingredients": [
      "bột mì",
      "trứng",
      "sữa",
      "bơ",
      "đường",
      "muối",
      "nhân (kem, trái cây, thịt)"
    ],
    "procedure": [
      "Trộn bột mì, trứng, sữa, bơ, đường và muối thành hỗn hợp đồng nhất.",
      "Đun nóng chảo chống dính và đổ một lượng bột vào chảo, trải đều.",
      "Chiên bánh cho đến khi mặt dưới vàng và lật lại để chiên mặt còn lại.",
      "Khi bánh chín, cho nhân vào giữa và gấp lại, có thể trang trí với trái cây hoặc kem."
    ],
    "comments": [
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Bánh crepes rất ngon, mình thích nhân trái cây!"
      },
      {
        "userName": "Bob",
        "reviewStar": 4,
        "commentText": "Món này dễ làm và rất thơm ngon!"
      },
      {
        "userName": "Harry",
        "reviewStar": 4,
        "commentText": "Rất thích ăn crepes, nhưng mình muốn thử nhiều nhân hơn."
      },
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Bánh này rất mềm và có hương vị tuyệt vời!"
      }
    ]
  },
  {
    "id": 41,
    "imageFilePath": "./image/41",
    "name": "Bánh mì Pháp",
    "reviewStar": 4.9,
    "reviewCount": 5,
    "viewCount": 12,
    "authorId": 4,
    "publishDate": "22/10/2024",
    "cookTime": "30 phút",
    "description": "Bánh mì Pháp là món bánh nổi tiếng, với lớp vỏ giòn và ruột mềm. Bánh mì thường được làm từ bột mì, nước, muối và men, là thành phần chính trong nhiều món ăn. Bạn có thể thưởng thức bánh mì kèm với thịt nguội, phô mai hoặc rau sống, tạo nên một bữa ăn nhanh ngon miệng.",
    "ingredients": [
      "bột mì",
      "nước",
      "muối",
      "men nở",
      "đường"
    ],
    "procedure": [
      "Trộn bột mì, muối, đường và men nở trong một bát lớn.",
      "Thêm nước từ từ và nhào bột cho đến khi mịn.",
      "Để bột nghỉ trong 1 giờ cho nở.",
      "Chia bột thành các phần nhỏ, nặn thành hình và để nghỉ thêm 30 phút.",
      "Nướng bánh ở 220 độ C trong khoảng 20 phút cho đến khi vàng giòn."
    ],
    "comments": [
      {
        "userName": "Alice",
        "reviewStar": 5,
        "commentText": "Bánh mì Pháp thật tuyệt vời, rất giòn và thơm!"
      },
      {
        "userName": "Emma",
        "reviewStar": 4,
        "commentText": "Món này rất dễ làm và ăn kèm với thịt rất ngon."
      },
      {
        "userName": "Fred",
        "reviewStar": 5,
        "commentText": "Rất thích bánh mì này, có thể ăn kèm với bất kỳ thứ gì!"
      },
      {
        "userName": "Gina",
        "reviewStar": 4,
        "commentText": "Món ăn đơn giản nhưng lại rất hấp dẫn!"
      },
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Bánh mì Pháp tuyệt vời, mình sẽ làm thường xuyên!"
      }
    ]
  },
  {
    "id": 42,
    "imageFilePath": "./image/42",
    "name": "Gỏi cuốn",
    "reviewStar": 4.8,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 4,
    "publishDate": "22/10/2024",
    "cookTime": "20 phút",
    "description": "Gỏi cuốn là món ăn truyền thống của Việt Nam, gồm các nguyên liệu tươi ngon cuộn trong bánh tráng. Món này thường được ăn kèm với nước chấm như nước tương hoặc nước mắm pha chua ngọt. Gỏi cuốn là sự lựa chọn tuyệt vời cho những ai yêu thích ẩm thực nhẹ nhàng và tươi mát.",
    "ingredients": [
      "bánh tráng",
      "tôm",
      "thịt heo",
      "rau sống (xà lách, húng quế)",
      "bún",
      "nước chấm"
    ],
    "procedure": [
      "Luộc tôm và thịt heo, sau đó thái thành miếng mỏng.",
      "Ngâm bánh tráng trong nước ấm cho mềm.",
      "Xếp rau sống, bún, tôm và thịt lên bánh tráng.",
      "Cuộn bánh tráng chặt tay và cắt thành từng cuốn nhỏ.",
      "Dọn ra đĩa và thưởng thức với nước chấm."
    ],
    "comments": [
      {
        "userName": "Bob",
        "reviewStar": 5,
        "commentText": "Gỏi cuốn rất tươi ngon, thích hợp cho mùa hè!"
      },
      {
        "userName": "Ivy",
        "reviewStar": 4,
        "commentText": "Món này rất dễ làm và rất thú vị!"
      },
      {
        "userName": "Dave",
        "reviewStar": 4,
        "commentText": "Rất thích ăn gỏi cuốn, nhưng cần thêm nước chấm."
      },
      {
        "userName": "Harry",
        "reviewStar": 5,
        "commentText": "Món ăn nhẹ và đầy màu sắc, rất ngon!"
      }
    ]
  },
  {
    "id": 43,
    "imageFilePath": "./image/43",
    "name": "Kim chi",
    "reviewStar": 4.5,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 4,
    "publishDate": "22/10/2024",
    "cookTime": "60 phút",
    "description": "Kim chi là món ăn truyền thống của Hàn Quốc, được làm từ rau củ lên men, thường là cải thảo và củ cải, cùng với gia vị như ớt bột và tỏi. Món ăn này không chỉ có hương vị cay nồng mà còn rất bổ dưỡng. Kim chi là món ăn phụ không thể thiếu trong bữa cơm Hàn Quốc.",
    "ingredients": [
      "cải thảo",
      "củ cải",
      "ớt bột Hàn Quốc",
      "tỏi",
      "gừng",
      "nước mắm",
      "đường"
    ],
    "procedure": [
      "Cắt cải thảo và củ cải thành miếng vừa ăn, sau đó rửa sạch.",
      "Trộn các nguyên liệu gia vị với nhau để tạo thành hỗn hợp ướp.",
      "Trộn cải thảo và củ cải với hỗn hợp gia vị, đảm bảo gia vị bám đều.",
      "Cho vào hũ đậy kín và để ở nhiệt độ phòng trong khoảng 1 ngày cho lên men.",
      "Sau khi lên men, bảo quản trong tủ lạnh và thưởng thức."
    ],
    "comments": [
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Kim chi thật sự rất ngon và có hương vị độc đáo!"
      },
      {
        "userName": "Emma",
        "reviewStar": 4,
        "commentText": "Món này cay quá, nhưng rất thú vị!"
      },
      {
        "userName": "Ivy",
        "reviewStar": 4,
        "commentText": "Kim chi rất tuyệt, mình thích ăn kèm với cơm!"
      }
    ]
  },
  {
    "id": 44,
    "imageFilePath": "./image/44",
    "name": "Cá hồi nướng",
    "reviewStar": 4.8,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 4,
    "publishDate": "22/10/2024",
    "cookTime": "35 phút",
    "description": "Cá hồi nướng là món ăn ngon và bổ dưỡng, thường được chế biến đơn giản để giữ nguyên hương vị tự nhiên của cá. Món ăn này thường được ăn kèm với rau củ nướng hoặc salad tươi mát. Với sự kết hợp giữa vị béo ngậy của cá hồi và các gia vị nhẹ nhàng, món này sẽ mang đến trải nghiệm ẩm thực tuyệt vời.",
    "ingredients": [
      "cá hồi",
      "tỏi",
      "chanh",
      "dầu ô liu",
      "muối",
      "tiêu",
      "rau thơm"
    ],
    "procedure": [
      "Làm sạch cá hồi và để ráo nước.",
      "Trộn tỏi băm, nước cốt chanh, dầu ô liu, muối và tiêu để làm sốt.",
      "Phết đều sốt lên bề mặt cá hồi.",
      "Nướng cá ở nhiệt độ 200 độ C trong khoảng 15-20 phút cho đến khi cá chín.",
      "Dọn ra đĩa và trang trí với rau thơm, thưởng thức nóng."
    ],
    "comments": [
      {
        "userName": "Fred",
        "reviewStar": 5,
        "commentText": "Cá hồi nướng thật tuyệt vời, rất mềm và ngon!"
      },
      {
        "userName": "Ivy",
        "reviewStar": 4,
        "commentText": "Món ăn rất dễ làm và bổ dưỡng!"
      },
      {
        "userName": "Harry",
        "reviewStar": 4,
        "commentText": "Thích cách chế biến này, cá rất ngọt và thơm!"
      },
      {
        "userName": "Alice",
        "reviewStar": 5,
        "commentText": "Món này là món ăn yêu thích của mình, rất hấp dẫn!"
      }
    ]
  },
  {
    "id": 45,
    "imageFilePath": "./image/45",
    "name": "Sushi",
    "reviewStar": 4.6,
    "reviewCount": 3,
    "viewCount": 12,
    "authorId": 4,
    "publishDate": "22/10/2024",
    "cookTime": "45 phút",
    "description": "Sushi là món ăn nổi tiếng của Nhật Bản, được làm từ cơm và các loại nguyên liệu như cá sống, rau củ hoặc trứng. Món ăn này không chỉ đẹp mắt mà còn rất ngon miệng. Sushi có thể được chế biến theo nhiều kiểu khác nhau, mang đến sự đa dạng cho bữa ăn.",
    "ingredients": [
      "gạo sushi",
      "cá hồi",
      "cá ngừ",
      "dưa leo",
      "bánh rong biển",
      "wasabi",
      "nước tương"
    ],
    "procedure": [
      "Nấu gạo sushi theo hướng dẫn, để nguội và trộn với giấm.",
      "Cắt cá và rau củ thành miếng mỏng.",
      "Đặt một lớp gạo lên bánh rong biển, thêm cá và rau củ lên trên.",
      "Cuộn chặt bánh rong biển lại, sau đó cắt thành từng miếng nhỏ.",
      "Dọn sushi với wasabi và nước tương để thưởng thức."
    ],
    "comments": [
      {
        "userName": "Bob",
        "reviewStar": 5,
        "commentText": "Sushi rất ngon và đẹp mắt, yêu thích món này!"
      },
      {
        "userName": "Emma",
        "reviewStar": 4,
        "commentText": "Một món ăn thú vị, nhưng có thể hơi khó làm."
      },
      {
        "userName": "Claire",
        "reviewStar": 4,
        "commentText": "Món này rất ngon, ăn kèm với nước tương rất tuyệt!"
      }
    ]
  },
  {
    "id": 46,
    "imageFilePath": "./image/46",
    "name": "Pizza Margherita",
    "reviewStar": 4.7,
    "reviewCount": 5,
    "viewCount": 12,
    "authorId": 4,
    "publishDate": "22/10/2024",
    "cookTime": "25 phút",
    "description": "Pizza Margherita là món pizza truyền thống của Ý, với lớp đế mỏng, sốt cà chua tươi, phô mai mozzarella và lá basil. Món pizza này nổi bật với hương vị tươi ngon và đơn giản, là sự lựa chọn lý tưởng cho bữa tối hoặc bữa tiệc.",
    "ingredients": [
      "bột pizza",
      "sốt cà chua",
      "phô mai mozzarella",
      "lá basil",
      "dầu ô liu",
      "muối"
    ],
    "procedure": [
      "Nặn bột pizza thành hình tròn và cho lên khay nướng.",
      "Phết sốt cà chua lên mặt bột, sau đó thêm phô mai mozzarella lên trên.",
      "Rải lá basil và một chút muối, phết dầu ô liu lên.",
      "Nướng pizza ở nhiệt độ 220 độ C trong khoảng 15 phút cho đến khi vàng.",
      "Dọn ra đĩa và thưởng thức ngay khi còn nóng."
    ],
    "comments": [
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Pizza Margherita thật tuyệt vời, rất tươi ngon!"
      },
      {
        "userName": "Dave",
        "reviewStar": 4,
        "commentText": "Món pizza này rất dễ làm và thơm ngon!"
      },
      {
        "userName": "Harry",
        "reviewStar": 4,
        "commentText": "Thích ăn pizza, nhưng mình muốn thêm nhiều topping hơn."
      },
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Một trong những loại pizza yêu thích của mình!"
      },
      {
        "userName": "Bob",
        "reviewStar": 4,
        "commentText": "Ngon và đơn giản, rất hợp khẩu vị!"
      }
    ]
  },
  {
    "id": 47,
    "imageFilePath": "./image/47",
    "name": "Bò lúc lắc",
    "reviewStar": 4.8,
    "reviewCount": 5,
    "viewCount": 12,
    "authorId": 4,
    "publishDate": "22/10/2024",
    "cookTime": "30 phút",
    "description": "Bò lúc lắc là món ăn nổi tiếng của ẩm thực Việt Nam, với thịt bò được xào nhanh trên lửa lớn cùng với rau củ. Món ăn này có vị đậm đà, thơm ngon và thường được ăn kèm với cơm hoặc bánh mì. Bò lúc lắc là sự lựa chọn hoàn hảo cho bữa tối đầy dinh dưỡng.",
    "ingredients": [
      "thịt bò",
      "hành tây",
      "ớt chuông",
      "tỏi",
      "nước tương",
      "tiêu",
      "dầu ăn"
    ],
    "procedure": [
      "Thái thịt bò thành miếng vừa ăn và ướp với nước tương, tiêu, và tỏi băm.",
      "Đun nóng chảo với dầu ăn, sau đó cho thịt bò vào xào nhanh trên lửa lớn.",
      "Thêm hành tây và ớt chuông vào xào cùng cho đến khi chín.",
      "Dọn ra đĩa và thưởng thức nóng với cơm hoặc bánh mì."
    ],
    "comments": [
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Bò lúc lắc rất ngon, thịt mềm và thấm gia vị!"
      },
      {
        "userName": "Emma",
        "reviewStar": 4,
        "commentText": "Món ăn này dễ làm và rất hợp khẩu vị của mình."
      },
      {
        "userName": "Ivy",
        "reviewStar": 4,
        "commentText": "Thích ăn bò lúc lắc, nhưng mình muốn thêm nhiều rau củ hơn."
      },
      {
        "userName": "Fred",
        "reviewStar": 5,
        "commentText": "Rất ngon, ăn kèm với cơm thì tuyệt vời!"
      },
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Một trong những món ăn yêu thích của mình!"
      }
    ]
  },
  {
    "id": 48,
    "imageFilePath": "./image/48",
    "name": "Mì Ý sốt thịt bò",
    "reviewStar": 4.7,
    "reviewCount": 4,
    "viewCount": 12,
    "authorId": 4,
    "publishDate": "22/10/2024",
    "cookTime": "25 phút",
    "description": "Mì Ý sốt thịt bò là món ăn ngon miệng và dễ chế biến, với mì spaghetti được kết hợp cùng sốt thịt bò thơm ngon. Món ăn này rất được ưa chuộng và phù hợp cho các bữa tối gia đình. Sốt thịt bò có thể được chế biến từ thịt xay, cà chua và các gia vị, tạo nên hương vị hấp dẫn.",
    "ingredients": [
      "mì spaghetti",
      "thịt bò xay",
      "sốt cà chua",
      "hành tây",
      "tỏi",
      "basil tươi",
      "muối",
      "tiêu"
    ],
    "procedure": [
      "Luộc mì spaghetti theo hướng dẫn trên bao bì cho đến khi chín.",
      "Trong chảo, phi hành tây và tỏi băm cho thơm, sau đó thêm thịt bò xay vào xào.",
      "Thêm sốt cà chua và gia vị vào, nấu cho đến khi sốt đặc lại.",
      "Trộn mì với sốt thịt bò và dọn ra đĩa, trang trí với basil tươi."
    ],
    "comments": [
      {
        "userName": "Bob",
        "reviewStar": 5,
        "commentText": "Mì Ý sốt thịt bò rất ngon, mình thích cách chế biến này!"
      },
      {
        "userName": "Dave",
        "reviewStar": 4,
        "commentText": "Món ăn dễ làm, hương vị rất tuyệt vời!"
      },
      {
        "userName": "Alice",
        "reviewStar": 4,
        "commentText": "Một món ăn dễ làm và rất hợp khẩu vị."
      },
      {
        "userName": "Harry",
        "reviewStar": 5,
        "commentText": "Sốt thịt bò rất ngon, sẽ làm lại nhiều lần!"
      }
    ]
  },
  {
    "id": 49,
    "imageFilePath": "./image/49",
    "name": "Tiramisu",
    "reviewStar": 4.9,
    "reviewCount": 5,
    "viewCount": 12,
    "authorId": 4,
    "publishDate": "22/10/2024",
    "cookTime": "60 phút",
    "description": "Tiramisu là món tráng miệng nổi tiếng của Ý, được làm từ lớp bánh savoiardi nhúng cà phê, kem mascarpone và bột cacao. Món ăn này có hương vị thơm ngon và rất hấp dẫn, thường được phục vụ lạnh. Tiramisu là lựa chọn hoàn hảo cho các buổi tiệc hoặc bữa ăn cuối tuần.",
    "ingredients": [
      "bánh savoiardi",
      "kem mascarpone",
      "trứng",
      "đường",
      "cà phê",
      "bột cacao"
    ],
    "procedure": [
      "Đánh trứng với đường cho đến khi tạo bọt, sau đó thêm kem mascarpone vào trộn đều.",
      "Nhúng bánh savoiardi vào cà phê và xếp vào khuôn.",
      "Đổ một lớp kem lên bánh, sau đó lặp lại cho đến khi đầy khuôn.",
      "Để trong tủ lạnh ít nhất 4 giờ trước khi thưởng thức, rắc bột cacao lên trên."
    ],
    "comments": [
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Tiramisu thật tuyệt, hương vị thơm ngon và béo ngậy!"
      },
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Một món tráng miệng tuyệt vời, rất thích hợp cho bữa tiệc!"
      },
      {
        "userName": "Gina",
        "reviewStar": 4,
        "commentText": "Món này hơi ngọt, nhưng rất ngon!"
      },
      {
        "userName": "Emma",
        "reviewStar": 4,
        "commentText": "Một món ăn thú vị và độc đáo, sẽ làm lại lần sau!"
      },
      {
        "userName": "Fred",
        "reviewStar": 5,
        "commentText": "Rất thích món này, hương vị không thể cưỡng lại!"
      }
    ]
  },
  {
    "id": 50,
    "imageFilePath": "./image/50",
    "name": "Bánh kem Socola",
    "reviewStar": 4.8,
    "reviewCount": 5,
    "viewCount": 12,
    "authorId": 4,
    "publishDate": "22/10/2024",
    "cookTime": "50 phút",
    "description": "Bánh kem socola là món tráng miệng phổ biến và yêu thích của nhiều người. Với lớp bánh mềm mại, phủ kem socola béo ngậy, món bánh này mang đến hương vị thơm ngon và hấp dẫn. Bánh kem socola rất thích hợp cho các buổi tiệc sinh nhật hoặc các dịp đặc biệt.",
    "ingredients": [
      "bột mì",
      "đường",
      "bột cacao",
      "trứng",
      "sữa tươi",
      "bơ",
      "kem whipping"
    ],
    "procedure": [
      "Làm nóng lò nướng ở 180 độ C và chuẩn bị khuôn bánh.",
      "Trộn bột mì, bột cacao và đường trong một bát lớn.",
      "Thêm trứng, sữa tươi và bơ đã đun chảy vào, khuấy đều cho đến khi hỗn hợp mịn.",
      "Đổ hỗn hợp vào khuôn và nướng trong khoảng 25-30 phút.",
      "Để bánh nguội, sau đó đánh kem whipping với đường cho đến khi bông cứng.",
      "Phủ kem lên bánh và trang trí theo ý thích trước khi thưởng thức."
    ],
    "comments": [
      {
        "userName": "Alice",
        "reviewStar": 5,
        "commentText": "Bánh kem socola thật ngon và hấp dẫn, rất thích!"
      },
      {
        "userName": "Harry",
        "reviewStar": 5,
        "commentText": "Một món tráng miệng tuyệt vời, sẽ làm lại cho bữa tiệc sắp tới!"
      },
      {
        "userName": "Ivy",
        "reviewStar": 4,
        "commentText": "Bánh mềm và kem rất ngon, nhưng mình thích ngọt hơn một chút."
      },
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Rất ngon, mình sẽ giới thiệu món này cho bạn bè!"
      },
      {
        "userName": "Emma",
        "reviewStar": 4,
        "commentText": "Bánh kem rất dễ làm và ngon, mình đã thử và rất thành công!"
      }
    ]
  },
  {
    "id": 52,
    "imageFilePath": "./image/52",
    "name": "Gà xào sả ớt",
    "reviewStar": 4.5,
    "reviewCount": 4,
    "authorId": 0,
    "publishDate": "22/10/2024",
    "cookTime": "30 phút",
    "description": "Gà xào sả ớt là món ăn đậm đà, thơm nồng vị sả và cay cay của ớt. Món này rất hợp khi ăn cùng cơm trắng, đặc biệt trong những ngày trời se lạnh. Sự kết hợp giữa thịt gà và sả tạo nên hương vị hấp dẫn khó quên.",
    "ingredients": [
      "thịt gà",
      "sả",
      "ớt",
      "tỏi",
      "nước mắm",
      "đường",
      "hạt tiêu"
    ],
    "procedure": [
      "Rửa sạch thịt gà và cắt thành miếng vừa ăn.",
      "Băm nhỏ sả, tỏi, và ớt.",
      "Cho dầu vào chảo, làm nóng và phi thơm tỏi với sả.",
      "Thêm thịt gà vào xào cho đến khi chín.",
      "Nêm nước mắm, đường, và hạt tiêu, xào thêm 5 phút.",
      "Dọn ra đĩa và thưởng thức với cơm."
    ],
    "comments": [
      {
        "userName": "Alice",
        "reviewStar": 5,
        "commentText": "Món này rất ngon và đậm đà, sẽ làm lại nhiều lần!"
      },
      {
        "userName": "Harry",
        "reviewStar": 4,
        "commentText": "Cay cay vừa đủ, mình thích vị sả trong món này."
      },
      {
        "userName": "Gina",
        "reviewStar": 4,
        "commentText": "Rất dễ làm, món ăn này thích hợp cho bữa cơm gia đình."
      },
      {
        "userName": "Emma",
        "reviewStar": 5,
        "commentText": "Thịt gà rất mềm, món này thật sự ngon!"
      }
    ]
  },
  {
    "id": 53,
    "imageFilePath": "./image/53",
    "name": "Cơm gà xối mỡ",
    "reviewStar": 4.6,
    "reviewCount": 5,
    "authorId": 0,
    "publishDate": "22/10/2024",
    "cookTime": "1 giờ",
    "description": "Cơm gà xối mỡ là món ăn nổi tiếng với cơm dẻo thơm, thịt gà giòn rụm. Món này rất được yêu thích trong các bữa tiệc và là lựa chọn lý tưởng cho những ai yêu thích hương vị đậm đà. Kèm theo là nước sốt và dưa leo, tạo nên một bữa ăn hoàn hảo.",
    "ingredients": [
      "thịt gà",
      "gạo",
      "hành tây",
      "tỏi",
      "nước tương",
      "mỡ gà",
      "rau sống"
    ],
    "procedure": [
      "Nấu cơm với hành tây và tỏi cho thơm.",
      "Chiên thịt gà trong mỡ cho đến khi vàng giòn.",
      "Cho cơm ra đĩa, đặt thịt gà lên trên.",
      "Rưới nước tương lên món ăn và trang trí với rau sống.",
      "Thưởng thức nóng cùng với nước sốt."
    ],
    "comments": [
      {
        "userName": "Bob",
        "reviewStar": 5,
        "commentText": "Món này rất ngon, mình không thể cưỡng lại!"
      },
      {
        "userName": "Ivy",
        "reviewStar": 4,
        "commentText": "Thịt gà rất giòn, nhưng cơm cần thêm chút gia vị."
      },
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Một trong những món ăn yêu thích của mình, thật sự tuyệt vời!"
      },
      {
        "userName": "Dave",
        "reviewStar": 4,
        "commentText": "Ngon lắm, nhưng có thể thêm chút cay cho hấp dẫn hơn."
      },
      {
        "userName": "Fred",
        "reviewStar": 5,
        "commentText": "Rất ngon, đã giới thiệu cho bạn bè và họ cũng thích!"
      }
    ]
  },
  {
    "id": 54,
    "imageFilePath": "./image/54",
    "name": "Gà chiên nước mắm",
    "reviewStar": 4.8,
    "reviewCount": 5,
    "authorId": 0,
    "publishDate": "22/10/2024",
    "cookTime": "45 phút",
    "description": "Gà chiên nước mắm là món ăn quen thuộc trong bữa cơm gia đình. Gà được ướp thấm gia vị và chiên cho đến khi vàng giòn, sau đó được rưới nước mắm thơm ngon. Món này có vị mặn ngọt vừa phải, rất thích hợp với cơm trắng nóng.",
    "ingredients": [
      "thịt gà",
      "nước mắm",
      "đường",
      "tỏi",
      "hành tím",
      "tiêu",
      "dầu ăn"
    ],
    "procedure": [
      "Rửa sạch thịt gà, ướp với nước mắm, đường, tỏi băm và tiêu trong 30 phút.",
      "Đun nóng dầu trong chảo, cho thịt gà vào chiên cho đến khi vàng giòn.",
      "Lấy gà ra, để ráo dầu.",
      "Cho hành tím vào chảo xào thơm, sau đó cho gà trở lại chảo.",
      "Rưới thêm nước mắm và đảo đều cho thấm gia vị.",
      "Dọn ra đĩa và thưởng thức với cơm."
    ],
    "comments": [
      {
        "userName": "Alice",
        "reviewStar": 5,
        "commentText": "Thịt gà rất ngon và thấm vị nước mắm!"
      },
      {
        "userName": "Harry",
        "reviewStar": 4,
        "commentText": "Món này dễ làm và ngon miệng, thích hợp cho bữa ăn gia đình."
      },
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Thật sự là món ăn tuyệt vời, mình đã làm nhiều lần!"
      },
      {
        "userName": "Emma",
        "reviewStar": 5,
        "commentText": "Mình rất thích vị mặn ngọt của món này, ngon quá!"
      }
    ]
  },
  {
    "id": 55,
    "imageFilePath": "./image/55",
    "name": "Nấm xào tỏi",
    "reviewStar": 4.6,
    "reviewCount": 5,
    "authorId": 0,
    "publishDate": "23/10/2024",
    "cookTime": "20 phút",
    "description": "Nấm xào tỏi là món ăn đơn giản nhưng rất ngon miệng và bổ dưỡng. Nấm được xào nhanh với tỏi tạo nên hương thơm đặc trưng. Món này thường được dùng kèm với cơm hoặc bánh mì, rất thích hợp cho bữa ăn nhanh gọn.",
    "ingredients": [
      "nấm",
      "tỏi",
      "dầu ăn",
      "muối",
      "tiêu",
      "hạt nêm"
    ],
    "procedure": [
      "Rửa sạch nấm và cắt thành miếng vừa ăn.",
      "Băm nhỏ tỏi.",
      "Cho dầu vào chảo, đun nóng và phi thơm tỏi.",
      "Thêm nấm vào xào nhanh tay trong 5-7 phút.",
      "Nêm muối, tiêu và hạt nêm cho vừa ăn.",
      "Dọn ra đĩa và thưởng thức ngay."
    ],
    "comments": [
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Món này rất ngon, mình thích ăn với cơm!"
      },
      {
        "userName": "Bob",
        "reviewStar": 4,
        "commentText": "Nấm xào rất đơn giản nhưng lại rất hợp vị."
      },
      {
        "userName": "Ivy",
        "reviewStar": 5,
        "commentText": "Thích món này, vừa ngon vừa dễ làm!"
      },
      {
        "userName": "Dave",
        "reviewStar": 4,
        "commentText": "Cần thêm chút gia vị cho đậm đà hơn."
      },
      {
        "userName": "Harry",
        "reviewStar": 5,
        "commentText": "Rất tuyệt, sẽ làm lại cho bữa tối!"
      }
    ]
  },
  {
    "id": 56,
    "imageFilePath": "./image/56",
    "name": "Súp nấm",
    "reviewStar": 4.8,
    "reviewCount": 4,
    "authorId": 0,
    "publishDate": "23/10/2024",
    "cookTime": "30 phút",
    "description": "Súp nấm là món ăn nhẹ nhàng, thơm ngon và rất bổ dưỡng. Món này được chế biến từ nấm tươi, kết hợp với nước dùng và gia vị tạo nên một hương vị đặc trưng. Súp nấm thường được dùng nóng, rất thích hợp trong những ngày lạnh.",
    "ingredients": [
      "nấm",
      "nước dùng",
      "hành tây",
      "tỏi",
      "kem tươi",
      "muối",
      "tiêu"
    ],
    "procedure": [
      "Rửa sạch nấm và cắt nhỏ.",
      "Băm nhỏ hành tây và tỏi.",
      "Đun nước dùng trong nồi, thêm hành tây và tỏi vào xào thơm.",
      "Cho nấm vào nồi, nấu cho đến khi nấm mềm.",
      "Thêm kem tươi, nêm muối và tiêu cho vừa ăn.",
      "Xay nhuyễn nếu thích và dọn ra bát, thưởng thức nóng."
    ],
    "comments": [
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Súp nấm này rất ngon, mình thích ăn vào mùa đông!"
      },
      {
        "userName": "Emma",
        "reviewStar": 4,
        "commentText": "Ngon và dễ làm, nhưng nên thêm chút gia vị."
      },
      {
        "userName": "Claire",
        "reviewStar": 5,
        "commentText": "Món này rất tuyệt, mình sẽ làm cho cả nhà!"
      },
      {
        "userName": "Bob",
        "reviewStar": 4,
        "commentText": "Cần thêm nhiều nấm hơn để tăng độ ngon!"
      }
    ]
  },
  {
    "id": 57,
    "imageFilePath": "./image/57",
    "name": "Nấm nhồi thịt",
    "reviewStar": 4.7,
    "reviewCount": 3,
    "authorId": 0,
    "publishDate": "23/10/2024",
    "cookTime": "45 phút",
    "description": "Nấm nhồi thịt là món ăn hấp dẫn với phần nấm được nhồi đầy thịt và gia vị, sau đó nướng hoặc chiên cho đến khi chín vàng. Món này không chỉ ngon mà còn rất đẹp mắt, thường được dùng trong các bữa tiệc hoặc dịp đặc biệt.",
    "ingredients": [
      "nấm",
      "thịt heo",
      "hành tím",
      "tỏi",
      "muối",
      "tiêu",
      "hạt nêm"
    ],
    "procedure": [
      "Rửa sạch nấm và cắt bỏ cuống.",
      "Băm nhuyễn hành tím, tỏi và trộn đều với thịt heo, nêm gia vị.",
      "Nhồi hỗn hợp thịt vào trong nấm.",
      "Đặt nấm nhồi lên vỉ nướng hoặc chảo, chiên vàng đều hai mặt.",
      "Dọn ra đĩa, có thể trang trí với rau thơm và thưởng thức ngay."
    ],
    "comments": [
      {
        "userName": "Fred",
        "reviewStar": 5,
        "commentText": "Thật sự ngon, món này khiến mình rất thích!"
      },
      {
        "userName": "Ivy",
        "reviewStar": 4,
        "commentText": "Món này đẹp mắt và rất ngon, nhưng hơi cầu kỳ."
      },
      {
        "userName": "Dave",
        "reviewStar": 4,
        "commentText": "Nên nhồi nhiều thịt hơn để món ăn đậm đà hơn."
      }
    ]
  },
  {
    "id": 58,
    "imageFilePath": "./image/58",
    "name": "Mì Ý nấm sốt kem",
    "reviewStar": 4.5,
    "reviewCount": 5,
    "authorId": 0,
    "publishDate": "23/10/2024",
    "cookTime": "30 phút",
    "description": "Mì Ý nấm sốt kem là món ăn thơm ngon, bổ dưỡng và dễ làm. Mì được trộn với sốt kem béo ngậy cùng nấm tươi, tạo nên hương vị tuyệt vời. Đây là món ăn lý tưởng cho bữa tối nhẹ nhàng hoặc những dịp gặp gỡ bạn bè.",
    "ingredients": [
      "mì Ý",
      "nấm",
      "kem tươi",
      "hành tây",
      "tỏi",
      "muối",
      "tiêu",
      "phô mai"
    ],
    "procedure": [
      "Luộc mì Ý trong nước sôi cho đến khi chín mềm.",
      "Băm nhỏ hành tây và tỏi, xào thơm trong chảo.",
      "Thêm nấm vào xào cho mềm, sau đó cho kem tươi vào.",
      "Khuấy đều cho đến khi sốt sánh lại, nêm muối và tiêu.",
      "Trộn mì Ý vào sốt, rắc phô mai lên và thưởng thức ngay."
    ],
    "comments": [
      {
        "userName": "Emma",
        "reviewStar": 5,
        "commentText": "Món này rất ngon, mình thích sự béo ngậy của sốt kem!"
      },
      {
        "userName": "Ivy",
        "reviewStar": 4,
        "commentText": "Nên thêm một chút gia vị để món ăn thêm phần hấp dẫn."
      },
      {
        "userName": "Fred",
        "reviewStar": 5,
        "commentText": "Rất tuyệt! Món này rất hợp khẩu vị của mình."
      },
      {
        "userName": "Claire",
        "reviewStar": 4,
        "commentText": "Ngon, nhưng có vẻ hơi nhiều kem một chút."
      },
      {
        "userName": "Dave",
        "reviewStar": 4,
        "commentText": "Một món ăn tuyệt vời cho bữa tối nhanh gọn!"
      }
    ]
  },
  {
    "id": 59,
    "imageFilePath": "./image/59",
    "name": "Pizza nấm",
    "reviewStar": 4.9,
    "reviewCount": 4,
    "authorId": 0,
    "publishDate": "23/10/2024",
    "cookTime": "40 phút",
    "description": "Pizza nấm là món ăn phổ biến, rất được yêu thích. Đế pizza giòn rụm được phủ đầy nấm tươi, phô mai và các loại gia vị, mang đến hương vị thơm ngon khó cưỡng. Đây là sự lựa chọn tuyệt vời cho các bữa tiệc hoặc bữa ăn cuối tuần.",
    "ingredients": [
      "bột pizza",
      "nấm",
      "phô mai mozzarella",
      "sốt cà chua",
      "hành tây",
      "dầu ô liu",
      "húng quế"
    ],
    "procedure": [
      "Chuẩn bị bột pizza và làm nóng lò nướng ở 220 độ C.",
      "Trải bột pizza ra khay, phết đều sốt cà chua lên bề mặt.",
      "Rải nấm và hành tây lên trên, sau đó cho phô mai vào.",
      "Nướng pizza trong lò khoảng 15-20 phút cho đến khi phô mai chảy và đế vàng.",
      "Lấy ra, rắc húng quế lên và thưởng thức khi còn nóng."
    ],
    "comments": [
      {
        "userName": "Bob",
        "reviewStar": 5,
        "commentText": "Pizza này rất ngon, mình không thể ngừng ăn!"
      },
      {
        "userName": "Gina",
        "reviewStar": 5,
        "commentText": "Thích mùi vị của nấm và phô mai, thật tuyệt vời!"
      },
      {
        "userName": "Claire",
        "reviewStar": 4,
        "commentText": "Pizza rất ngon nhưng có vẻ hơi ít nấm."
      },
      {
        "userName": "Harry",
        "reviewStar": 5,
        "commentText": "Món này mình sẽ làm thường xuyên hơn cho gia đình!"
      }
    ]
  },
  {
    "id": 60,
    "imageFilePath": "./image/60",
    "name": "Bánh nấm cuốn",
    "reviewStar": 4.7,
    "reviewCount": 3,
    "authorId": 0,
    "publishDate": "23/10/2024",
    "cookTime": "25 phút",
    "description": "Bánh nấm cuốn là món ăn nhẹ nhàng, thích hợp cho các bữa tiệc hay món khai vị. Nấm được xào chín cùng với rau củ và cuốn trong lớp bánh mỏng, tạo nên sự kết hợp hoàn hảo giữa vị ngọt của nấm và độ giòn của bánh.",
    "ingredients": [
      "bánh tráng",
      "nấm",
      "cà rốt",
      "dưa chuột",
      "tỏi",
      "nước mắm",
      "hạt nêm"
    ],
    "procedure": [
      "Rửa sạch nấm và cắt nhỏ, cà rốt gọt vỏ và bào sợi.",
      "Băm tỏi và xào thơm với nấm và cà rốt, nêm gia vị vừa ăn.",
      "Ngâm bánh tráng vào nước ấm cho mềm.",
      "Cho hỗn hợp nấm vào giữa bánh tráng và cuộn lại.",
      "Dọn ra đĩa và dùng kèm với nước mắm chấm."
    ],
    "comments": [
      {
        "userName": "Alice",
        "reviewStar": 5,
        "commentText": "Thích món này, nhẹ nhàng và rất ngon!"
      },
      {
        "userName": "Gina",
        "reviewStar": 4,
        "commentText": "Món ăn rất tuyệt, nhưng hơi khó cuốn một chút."
      },
      {
        "userName": "Fred",
        "reviewStar": 4,
        "commentText": "Nên thử thêm các loại rau khác để tăng thêm hương vị."
      }
    ]
  }



]
